[
  {
    "slug": "reed-richards",
    "name": "Reed Richards",
    "aliases": [
      "Mr. Fantastic",
      "The Maker"
    ],
    "first_appearance_issue": "Fantastic Four #1 (1961)",
    "universe": "Earth-616",
    "teams": [
      "Fantastic Four",
      "Future Foundation",
      "Illuminati"
    ],
    "description": "Genius scientist and leader of the Fantastic Four. Gained the ability to stretch his body after exposure to cosmic rays. One of the most brilliant minds in the Marvel Universe, Reed has saved and rebuilt the multiverse itself. His Earth-1610 counterpart became the villainous Maker."
  },
  {
    "slug": "sue-storm",
    "name": "Sue Storm",
    "aliases": [
      "Invisible Woman",
      "Invisible Girl",
      "Susan Storm-Richards"
    ],
    "first_appearance_issue": "Fantastic Four #1 (1961)",
    "universe": "Earth-616",
    "teams": [
      "Fantastic Four",
      "Future Foundation",
      "Avengers"
    ],
    "description": "The most powerful member of the Fantastic Four. Sue can render herself and others invisible, and project nearly indestructible force fields. Mother of Franklin and Valeria Richards. Evolved from 'Invisible Girl' to 'Invisible Woman' — widely regarded as the team's backbone."
  },
  {
    "slug": "johnny-storm",
    "name": "Johnny Storm",
    "aliases": [
      "Human Torch"
    ],
    "first_appearance_issue": "Fantastic Four #1 (1961)",
    "universe": "Earth-616",
    "teams": [
      "Fantastic Four",
      "Future Foundation",
      "Avengers"
    ],
    "description": "Sue Storm's younger brother who gained the ability to engulf his body in flame and fly. Brash and hot-headed in early years, Johnny matured into a dependable hero. His friendship with Ben Grimm is one of Marvel's most enduring relationships. Died heroically in FF #587 before being resurrected."
  },
  {
    "slug": "ben-grimm",
    "name": "Ben Grimm",
    "aliases": [
      "The Thing"
    ],
    "first_appearance_issue": "Fantastic Four #1 (1961)",
    "universe": "Earth-616",
    "teams": [
      "Fantastic Four",
      "Future Foundation",
      "Avengers",
      "Guardians of the Galaxy"
    ],
    "description": "Former test pilot transformed into a rock-skinned powerhouse by cosmic rays. Unlike his teammates, Ben cannot revert to human form, making his transformation a source of deep anguish. His humanity despite his monstrous appearance is the emotional core of the Fantastic Four."
  },
  {
    "slug": "doctor-doom",
    "name": "Victor Von Doom",
    "aliases": [
      "Doctor Doom",
      "God Emperor Doom",
      "Infamous Iron Man",
      "Sorcerer Supreme"
    ],
    "first_appearance_issue": "Fantastic Four #5 (1962)",
    "universe": "Earth-616",
    "teams": [
      "Cabal",
      "Future Foundation"
    ],
    "description": "Monarch of Latveria and Marvel's greatest villain. A genius rivaling Reed Richards in science and Doctor Strange in sorcery. Doom has stolen the power of the Beyonder, become God Emperor of Battleworld, served as Iron Man, claimed the title of Sorcerer Supreme, and conquered the entire world in One World Under Doom. His arc from tyrant to complex antihero is one of Marvel's richest character journeys."
  },
  {
    "slug": "peter-parker",
    "name": "Peter Parker",
    "aliases": [
      "Spider-Man",
      "Spidey",
      "Web-Slinger",
      "Web-Head"
    ],
    "first_appearance_issue": "Amazing Fantasy #15 (1962)",
    "universe": "Earth-616",
    "teams": [
      "Avengers",
      "New Avengers",
      "Future Foundation",
      "Daily Bugle"
    ],
    "description": "Bitten by a radioactive spider, teenager Peter Parker gained superhuman strength, wall-crawling, and a precognitive spider-sense. Defined by the lesson 'With great power comes great responsibility' after his Uncle Ben's death. Marvel's flagship character. His marriage to Mary Jane was controversially erased by Mephisto in One More Day."
  },
  {
    "slug": "mary-jane-watson",
    "name": "Mary Jane Watson",
    "aliases": [
      "MJ",
      "Mary Jane Watson-Parker"
    ],
    "first_appearance_issue": "Amazing Spider-Man #25 (1965, partial); #42 (1966, full)",
    "universe": "Earth-616",
    "teams": [],
    "description": "Peter Parker's greatest love and most enduring partner. Originally introduced as a party girl, MJ evolved into a complex character who knew Peter's secret and chose to stand by him. Their marriage in ASM Annual #21 (1987) was erased by One More Day, one of Marvel's most controversial editorial decisions."
  },
  {
    "slug": "norman-osborn",
    "name": "Norman Osborn",
    "aliases": [
      "Green Goblin",
      "Iron Patriot"
    ],
    "first_appearance_issue": "Amazing Spider-Man #14 (1964)",
    "universe": "Earth-616",
    "teams": [
      "Sinister Six",
      "Dark Avengers",
      "Cabal",
      "H.A.M.M.E.R."
    ],
    "description": "Industrialist driven insane by the Goblin Formula. As the Green Goblin, he killed Gwen Stacy in ASM #121 — one of the most important moments in comic history. Later rose to political power during Dark Reign, leading H.A.M.M.E.R. and the Dark Avengers as the Iron Patriot. Spider-Man's greatest enemy."
  },
  {
    "slug": "steve-rogers",
    "name": "Steve Rogers",
    "aliases": [
      "Captain America",
      "Nomad",
      "The Captain"
    ],
    "first_appearance_issue": "Captain America Comics #1 (1941); revived Avengers #4 (1964)",
    "universe": "Earth-616",
    "teams": [
      "Avengers",
      "Secret Avengers",
      "Invaders",
      "S.H.I.E.L.D."
    ],
    "description": "A frail young man transformed by the Super-Soldier Serum during World War II. Frozen in ice and revived by the Avengers in issue #4, becoming the team's moral compass. Led the anti-registration side in Civil War. Assassinated by a brainwashed Sharon Carter in Brubaker's run, later resurrected. The living embodiment of the Marvel Universe's ideals."
  },
  {
    "slug": "tony-stark",
    "name": "Tony Stark",
    "aliases": [
      "Iron Man"
    ],
    "first_appearance_issue": "Tales of Suspense #39 (1963)",
    "universe": "Earth-616",
    "teams": [
      "Avengers",
      "Illuminati",
      "S.H.I.E.L.D."
    ],
    "description": "Genius billionaire inventor who built the Iron Man armor while held captive. Led the pro-registration side in Civil War and became Director of S.H.I.E.L.D. A founding Avenger whose battle with alcoholism (Demon in a Bottle) was groundbreaking for comics. His friendship and rivalry with Steve Rogers drives much of modern Marvel."
  },
  {
    "slug": "thor-odinson",
    "name": "Thor Odinson",
    "aliases": [
      "Thor",
      "God of Thunder",
      "Donald Blake",
      "Odinson"
    ],
    "first_appearance_issue": "Journey into Mystery #83 (1962)",
    "universe": "Earth-616",
    "teams": [
      "Avengers",
      "Warriors Three",
      "Asgardians"
    ],
    "description": "The Asgardian God of Thunder and a founding Avenger. Wields the enchanted hammer Mjolnir. Walt Simonson's run defined the character for generations, introducing Beta Ray Bill and the Surtur Saga. Jason Aaron's run saw Thor become unworthy, with Jane Foster taking up the mantle."
  },
  {
    "slug": "bruce-banner",
    "name": "Bruce Banner",
    "aliases": [
      "The Hulk",
      "Incredible Hulk",
      "Joe Fixit",
      "World-Breaker Hulk",
      "Devil Hulk"
    ],
    "first_appearance_issue": "Incredible Hulk #1 (1962)",
    "universe": "Earth-616",
    "teams": [
      "Avengers",
      "Defenders",
      "Warbound"
    ],
    "description": "Physicist transformed by gamma radiation into the Hulk — the strongest one there is. Banner's fractured psyche manifests as multiple Hulk personas. Al Ewing's Immortal Hulk reframed the character through cosmic horror, revealing the Hulk as an immortal avatar of a gamma god. One of Marvel's most psychologically complex characters."
  },
  {
    "slug": "natasha-romanoff",
    "name": "Natasha Romanoff",
    "aliases": [
      "Black Widow",
      "Natalia Romanova"
    ],
    "first_appearance_issue": "Tales of Suspense #52 (1964)",
    "universe": "Earth-616",
    "teams": [
      "Avengers",
      "S.H.I.E.L.D.",
      "Champions"
    ],
    "description": "Former Soviet spy and Red Room graduate who defected to become one of the world's greatest espionage agents. A core Avenger with no superpowers — just extraordinary training, intelligence, and will. Her complicated history with the Winter Soldier and Daredevil adds depth to her story."
  },
  {
    "slug": "clint-barton",
    "name": "Clint Barton",
    "aliases": [
      "Hawkeye",
      "Goliath",
      "Ronin"
    ],
    "first_appearance_issue": "Tales of Suspense #57 (1964)",
    "universe": "Earth-616",
    "teams": [
      "Avengers",
      "West Coast Avengers",
      "Thunderbolts",
      "S.H.I.E.L.D."
    ],
    "description": "World's greatest marksman who started as a villain before joining Cap's Kooky Quartet in Avengers #16. Has used multiple identities including Goliath and Ronin. Matt Fraction and David Aja's Hawkeye run redefined the character as a lovable, street-level everyman."
  },
  {
    "slug": "wanda-maximoff",
    "name": "Wanda Maximoff",
    "aliases": [
      "Scarlet Witch"
    ],
    "first_appearance_issue": "X-Men #4 (1964)",
    "universe": "Earth-616",
    "teams": [
      "Avengers",
      "Brotherhood of Evil Mutants",
      "West Coast Avengers",
      "Force Works"
    ],
    "description": "Wielder of chaos magic and hex powers. Originally introduced as Magneto's daughter (later retconned). Her mental breakdown in Avengers: Disassembled killed Hawkeye, Vision, and Ant-Man. Her words 'No more mutants' in House of M depowered 98% of Earth's mutant population, reshaping the Marvel Universe for a decade."
  },
  {
    "slug": "pietro-maximoff",
    "name": "Pietro Maximoff",
    "aliases": [
      "Quicksilver"
    ],
    "first_appearance_issue": "X-Men #4 (1964)",
    "universe": "Earth-616",
    "teams": [
      "Avengers",
      "Brotherhood of Evil Mutants",
      "X-Factor",
      "Inhumans"
    ],
    "description": "Mutant speedster and Wanda's twin brother. Joined the Avengers in Cap's Kooky Quartet alongside Hawkeye and Scarlet Witch. Arrogant and impatient — he perceives everyone as moving in slow motion. Married Crystal of the Inhumans. His parentage has been retconned multiple times."
  },
  {
    "slug": "vision",
    "name": "Vision",
    "aliases": [
      "The Vision",
      "Victor Shade"
    ],
    "first_appearance_issue": "Avengers #57 (1968)",
    "universe": "Earth-616",
    "teams": [
      "Avengers",
      "West Coast Avengers"
    ],
    "description": "Synthezoid created by Ultron using the brain patterns of Wonder Man. His romance with Scarlet Witch was one of Marvel's most celebrated love stories. Dismantled and rebuilt without emotions in West Coast Avengers. Tom King's Vision series explored his attempt to build a suburban family — widely considered a modern masterpiece."
  },
  {
    "slug": "hank-pym",
    "name": "Hank Pym",
    "aliases": [
      "Ant-Man",
      "Giant-Man",
      "Goliath",
      "Yellowjacket",
      "The Wasp",
      "Ultron"
    ],
    "first_appearance_issue": "Tales to Astonish #27 (1962)",
    "universe": "Earth-616",
    "teams": [
      "Avengers",
      "West Coast Avengers",
      "Mighty Avengers"
    ],
    "description": "Brilliant but troubled scientist who discovered Pym Particles, enabling size-changing. A founding Avenger under multiple identities. Created Ultron, one of the Avengers' deadliest foes. His domestic abuse of Janet Van Dyne remains one of Marvel's most controversial character moments."
  },
  {
    "slug": "janet-van-dyne",
    "name": "Janet Van Dyne",
    "aliases": [
      "The Wasp"
    ],
    "first_appearance_issue": "Tales to Astonish #44 (1963)",
    "universe": "Earth-616",
    "teams": [
      "Avengers",
      "Lady Liberators"
    ],
    "description": "A founding Avenger and one of the team's most effective leaders. Janet can shrink, fly on bio-synthetic wings, and fire bioelectric 'wasp stings.' She named the Avengers and served as chairperson multiple times. A fashion designer whose many costume changes became a beloved character trait."
  },
  {
    "slug": "t-challa",
    "name": "T'Challa",
    "aliases": [
      "Black Panther",
      "King of the Dead"
    ],
    "first_appearance_issue": "Fantastic Four #52 (1966)",
    "universe": "Earth-616",
    "teams": [
      "Avengers",
      "Illuminati",
      "Fantastic Four",
      "Ultimates"
    ],
    "description": "King of Wakanda and the first Black superhero in mainstream American comics. A polymath genius, Olympic-level athlete, and spiritual leader empowered by the Heart-Shaped Herb. Christopher Priest's run reinvented him as a geopolitical mastermind. Ta-Nehisi Coates explored the tensions between monarchy and justice."
  },
  {
    "slug": "scott-summers",
    "name": "Scott Summers",
    "aliases": [
      "Cyclops",
      "Slim"
    ],
    "first_appearance_issue": "X-Men #1 (1963)",
    "universe": "Earth-616",
    "teams": [
      "X-Men",
      "X-Factor",
      "Krakoan Quiet Council"
    ],
    "description": "The X-Men's first field leader. Fires uncontrollable optic blasts from his eyes. Originally the straight-laced boy scout, Scott's character deepened dramatically under Claremont and later writers. His affair with Emma Frost, killing Professor X while possessed by the Phoenix, and leadership of mutant revolution on Krakoa chart his complex evolution."
  },
  {
    "slug": "jean-grey",
    "name": "Jean Grey",
    "aliases": [
      "Marvel Girl",
      "Phoenix",
      "Dark Phoenix"
    ],
    "first_appearance_issue": "X-Men #1 (1963)",
    "universe": "Earth-616",
    "teams": [
      "X-Men",
      "X-Factor",
      "Krakoan Quiet Council"
    ],
    "description": "Omega-level telepath and telekinetic. The Phoenix Saga and Dark Phoenix Saga defined the X-Men as a franchise — Jean's sacrifice in Uncanny X-Men #137 is one of the most important moments in comics. Her death, resurrection, and connection to the Phoenix Force is the central thread of X-Men mythology."
  },
  {
    "slug": "ororo-munroe",
    "name": "Ororo Munroe",
    "aliases": [
      "Storm",
      "Goddess"
    ],
    "first_appearance_issue": "Giant-Size X-Men #1 (1975)",
    "universe": "Earth-616",
    "teams": [
      "X-Men",
      "Avengers",
      "Fantastic Four",
      "Krakoan Quiet Council"
    ],
    "description": "Weather-manipulating Omega-level mutant, worshiped as a goddess in Kenya. Led the X-Men through their most turbulent periods. Married T'Challa (later annulled). One of the most powerful and respected heroes in the Marvel Universe. Her claustrophobia, stemming from childhood trauma, adds vulnerability to her regal bearing."
  },
  {
    "slug": "wolverine",
    "name": "Logan",
    "aliases": [
      "Wolverine",
      "James Howlett",
      "Weapon X",
      "Patch",
      "Old Man Logan"
    ],
    "first_appearance_issue": "Incredible Hulk #181 (1974)",
    "universe": "Earth-616",
    "teams": [
      "X-Men",
      "Avengers",
      "X-Force",
      "Alpha Flight",
      "Weapon X"
    ],
    "description": "Canadian mutant with an adamantium-laced skeleton, retractable claws, and a healing factor. Over 100 years old with a tortured past. Became Marvel's most popular character in the 1980s-90s. His berserker rage contrasts with a deep code of honor. Barry Windsor-Smith's Weapon X is the definitive origin story."
  },
  {
    "slug": "charles-xavier",
    "name": "Charles Xavier",
    "aliases": [
      "Professor X",
      "Onslaught"
    ],
    "first_appearance_issue": "X-Men #1 (1963)",
    "universe": "Earth-616",
    "teams": [
      "X-Men",
      "Illuminati",
      "Krakoan Quiet Council"
    ],
    "description": "The world's most powerful telepath and founder of the X-Men. His dream of peaceful human-mutant coexistence drives the X-Men franchise. Hickman's Krakoa era revealed a far more morally ambiguous Xavier — willing to use memory manipulation and ally with former enemies. Killed by Cyclops in Avengers vs. X-Men, later resurrected."
  },
  {
    "slug": "magneto",
    "name": "Erik Lehnsherr",
    "aliases": [
      "Magneto",
      "Max Eisenhardt",
      "Erik Magnus"
    ],
    "first_appearance_issue": "X-Men #1 (1963)",
    "universe": "Earth-616",
    "teams": [
      "Brotherhood of Evil Mutants",
      "X-Men",
      "Hellfire Club",
      "Krakoan Quiet Council"
    ],
    "description": "Master of magnetism and Holocaust survivor whose trauma forged an uncompromising stance on mutant survival. Originally a one-dimensional villain, Claremont transformed him into Marvel's most sympathetic antagonist. His partnership with Xavier on Krakoa showed what they could achieve together. One of the most complex characters in all of comics."
  },
  {
    "slug": "rogue",
    "name": "Anna Marie",
    "aliases": [
      "Rogue"
    ],
    "first_appearance_issue": "Avengers Annual #10 (1981)",
    "universe": "Earth-616",
    "teams": [
      "X-Men",
      "Avengers Unity Squad",
      "Brotherhood of Evil Mutants"
    ],
    "description": "Mutant who absorbs memories, abilities, and life force through skin contact. Permanently absorbed Ms. Marvel's powers of flight and super-strength. Her inability to touch others without harming them is one of Marvel's most poignant character concepts. Her romance with Gambit is iconic. Led the Avengers Unity Squad."
  },
  {
    "slug": "emma-frost",
    "name": "Emma Frost",
    "aliases": [
      "White Queen"
    ],
    "first_appearance_issue": "Uncanny X-Men #129 (1980)",
    "universe": "Earth-616",
    "teams": [
      "X-Men",
      "Hellfire Club",
      "Generation X",
      "Krakoan Quiet Council"
    ],
    "description": "Omega-level telepath with secondary diamond form mutation. Began as a Hellfire Club villain but evolved into one of the X-Men's most compelling members. Her relationship with Cyclops and her sharp, unapologetic personality redefined the X-Men's dynamics. Grant Morrison and Joss Whedon made her central to modern X-Men."
  },
  {
    "slug": "kurt-wagner",
    "name": "Kurt Wagner",
    "aliases": [
      "Nightcrawler"
    ],
    "first_appearance_issue": "Giant-Size X-Men #1 (1975)",
    "universe": "Earth-616",
    "teams": [
      "X-Men",
      "Excalibur"
    ],
    "description": "German mutant teleporter with a demonic appearance — blue skin, pointed tail, three-fingered hands. Despite his frightening looks, Kurt is the X-Men's most joyful and compassionate member, a devout Catholic and swashbuckling adventurer. His faith and warmth make him the heart of any team he joins."
  },
  {
    "slug": "piotr-rasputin",
    "name": "Piotr Rasputin",
    "aliases": [
      "Colossus"
    ],
    "first_appearance_issue": "Giant-Size X-Men #1 (1975)",
    "universe": "Earth-616",
    "teams": [
      "X-Men",
      "Excalibur",
      "X-Force"
    ],
    "description": "Russian mutant who can transform his body into organic steel, becoming nearly invulnerable with immense strength. A gentle artist and farmer at heart, forced into violence by circumstance. His sacrifice to cure the Legacy Virus was a defining X-Men moment. His sister Illyana (Magik) and his relationship with Kitty Pryde are key storylines."
  },
  {
    "slug": "matt-murdock",
    "name": "Matt Murdock",
    "aliases": [
      "Daredevil",
      "The Man Without Fear"
    ],
    "first_appearance_issue": "Daredevil #1 (1964)",
    "universe": "Earth-616",
    "teams": [
      "Avengers",
      "Defenders",
      "The Hand"
    ],
    "description": "Blinded by radioactive waste as a child, Matt's remaining senses were enhanced to superhuman levels. A lawyer by day and vigilante by night in Hell's Kitchen. Frank Miller's run reinvented the character as Marvel's noir flagship. Bendis, Brubaker, and Zdarsky continued pushing Matt into darker territory. His faith, guilt, and resilience define the character."
  },
  {
    "slug": "frank-castle",
    "name": "Frank Castle",
    "aliases": [
      "The Punisher"
    ],
    "first_appearance_issue": "Amazing Spider-Man #129 (1974)",
    "universe": "Earth-616",
    "teams": [],
    "description": "A former Marine whose family was murdered by the mob, driving him to wage a one-man war on crime through lethal force. Operates outside the superhero community's moral code. Garth Ennis's MAX series is considered the definitive version — brutal, psychologically complex, and unflinching in its examination of violence and trauma."
  },
  {
    "slug": "marc-spector",
    "name": "Marc Spector",
    "aliases": [
      "Moon Knight",
      "Steven Grant",
      "Jake Lockley",
      "Mr. Knight"
    ],
    "first_appearance_issue": "Werewolf by Night #32 (1975)",
    "universe": "Earth-616",
    "teams": [
      "Avengers",
      "West Coast Avengers",
      "Secret Avengers",
      "Midnight Mission"
    ],
    "description": "Former mercenary resurrected by the Egyptian moon god Khonshu to serve as his avatar. Marc suffers from dissociative identity disorder, manifesting as multiple distinct personalities. Jeff Lemire's run explored his fractured psyche brilliantly. Often called 'Marvel's Batman' but far more psychologically unstable and spiritually complex."
  },
  {
    "slug": "thanos",
    "name": "Thanos",
    "aliases": [
      "The Mad Titan"
    ],
    "first_appearance_issue": "Iron Man #55 (1973)",
    "universe": "Earth-616",
    "teams": [
      "Black Order",
      "Infinity Watch"
    ],
    "description": "Eternal from Titan obsessed with Death — literally the cosmic embodiment of death. Created by Jim Starlin as the ultimate cosmic villain. Wielded the Infinity Gauntlet to destroy half the universe. His nihilistic philosophy and twisted love make him Marvel's most compelling cosmic threat. Starlin's Warlock and Infinity Gauntlet are his definitive stories."
  },
  {
    "slug": "adam-warlock",
    "name": "Adam Warlock",
    "aliases": [
      "Him",
      "Magus"
    ],
    "first_appearance_issue": "Fantastic Four #66-67 (1967, as Him); Marvel Premiere #1 (1972, as Warlock)",
    "universe": "Earth-616",
    "teams": [
      "Infinity Watch",
      "Guardians of the Galaxy"
    ],
    "description": "Artificially created being originally known as 'Him.' Jim Starlin transformed him into a cosmic messiah figure battling his own evil future self, the Magus, and the Universal Church of Truth. Possesses the Soul Gem. The key to defeating Thanos in the Infinity Gauntlet. One of Marvel's most philosophically complex characters."
  },
  {
    "slug": "silver-surfer",
    "name": "Norrin Radd",
    "aliases": [
      "Silver Surfer",
      "Sentinel of the Spaceways"
    ],
    "first_appearance_issue": "Fantastic Four #48 (1966)",
    "universe": "Earth-616",
    "teams": [
      "Heralds of Galactus",
      "Defenders",
      "Annihilators"
    ],
    "description": "Norrin Radd sacrificed his freedom to save his homeworld Zenn-La, becoming the herald of Galactus. Imbued with the Power Cosmic, he is one of the most powerful beings in the universe. His arrival in FF #48 heralded the Galactus Trilogy — arguably the most important cosmic story in comics. A figure of tragedy, nobility, and philosophical depth."
  },
  {
    "slug": "galactus",
    "name": "Galactus",
    "aliases": [
      "Galan",
      "The Devourer of Worlds",
      "Lifebringer"
    ],
    "first_appearance_issue": "Fantastic Four #48 (1966)",
    "universe": "Earth-616",
    "teams": [],
    "description": "The sole survivor of the universe before the Big Bang, reborn as a cosmic entity who consumes planets to sustain himself. Not evil — he is a force of nature, essential to the cosmic balance. Created by Lee and Kirby as a god beyond good and evil. Hickman's run featured Old Galactus as a key character. Briefly became the Lifebringer in Ultimates."
  },
  {
    "slug": "namor",
    "name": "Namor McKenzie",
    "aliases": [
      "Sub-Mariner",
      "Imperius Rex"
    ],
    "first_appearance_issue": "Marvel Comics #1 (1939); modern: Fantastic Four #4 (1962)",
    "universe": "Earth-616",
    "teams": [
      "Invaders",
      "Defenders",
      "Illuminati",
      "X-Men",
      "Avengers",
      "Cabal"
    ],
    "description": "Half-human, half-Atlantean king and Marvel's first mutant. Predates the Marvel Age, originating in 1939. Arrogant, regal, and unpredictable — he shifts between hero, antihero, and villain depending on Atlantis's interests. A founding member of the Illuminati. His rivalry with the surface world and his complex honor make him perpetually fascinating."
  },
  {
    "slug": "stephen-strange",
    "name": "Stephen Strange",
    "aliases": [
      "Doctor Strange",
      "Sorcerer Supreme"
    ],
    "first_appearance_issue": "Strange Tales #110 (1963)",
    "universe": "Earth-616",
    "teams": [
      "Avengers",
      "Defenders",
      "Illuminati",
      "New Avengers",
      "Midnight Sons"
    ],
    "description": "A brilliant but arrogant surgeon whose hands were destroyed in a car accident, leading him to the Ancient One and mastery of the mystic arts. Became Earth's Sorcerer Supreme, defending reality against magical and interdimensional threats. Killed during the Blood Hunt event, with Doctor Doom claiming his title."
  },
  {
    "slug": "luke-cage",
    "name": "Luke Cage",
    "aliases": [
      "Power Man",
      "Carl Lucas"
    ],
    "first_appearance_issue": "Luke Cage, Hero for Hire #1 (1972)",
    "universe": "Earth-616",
    "teams": [
      "Avengers",
      "New Avengers",
      "Thunderbolts",
      "Heroes for Hire",
      "Defenders"
    ],
    "description": "Wrongfully convicted and subjected to an experiment that gave him unbreakable skin and superhuman strength. Marvel's first Black title character. Originally a blaxploitation-era hero for hire, Bendis elevated Luke to Avengers leadership. His marriage to Jessica Jones and his role as a community pillar in Harlem define modern Luke Cage."
  },
  {
    "slug": "kamala-khan",
    "name": "Kamala Khan",
    "aliases": [
      "Ms. Marvel"
    ],
    "first_appearance_issue": "Captain Marvel #14 (2013); Ms. Marvel #1 (2014, solo)",
    "universe": "Earth-616",
    "teams": [
      "Champions",
      "Avengers",
      "New Warriors"
    ],
    "description": "Pakistani-American teenager from Jersey City who gained shapeshifting and embiggening powers from Terrigen Mist exposure. Marvel's first Muslim character to headline a solo series. Originally an Inhuman, she was retconned as a mutant in the Krakoa era. Her fanfiction-writing, Avengers-fangirl personality and strong cultural identity resonated with a new generation of readers. Died in Amazing Spider-Man #26 (2023) and was resurrected."
  },
  {
    "slug": "miles-morales",
    "name": "Miles Morales",
    "aliases": [
      "Spider-Man"
    ],
    "first_appearance_issue": "Ultimate Fallout #4 (2011)",
    "universe": "Earth-616 (originally Earth-1610)",
    "teams": [
      "Champions",
      "Avengers"
    ],
    "description": "Half-Black, half-Puerto Rican teenager from Brooklyn who became Spider-Man in the Ultimate Universe after Peter Parker's death. Miles has all of Peter's powers plus a venom sting and camouflage ability. Crossed into the main 616 universe after Secret Wars (2015). Now operates alongside Peter Parker as a second Spider-Man. Star of the acclaimed Spider-Verse animated films. Now one of Marvel's most important characters."
  },
  {
    "slug": "loki",
    "name": "Loki Laufeyson",
    "aliases": [
      "Loki",
      "God of Mischief",
      "God of Stories"
    ],
    "first_appearance_issue": "Journey into Mystery #85 (1962)",
    "universe": "Earth-616",
    "teams": [
      "Young Avengers"
    ],
    "description": "Thor's adopted brother and the Asgardian God of Mischief. Evolved from straightforward villain to one of Marvel's most complex characters. Al Ewing's Agent of Asgard and subsequent runs transformed Loki into the God of Stories."
  },
  {
    "slug": "shang-chi",
    "name": "Shang-Chi",
    "aliases": [
      "Master of Kung Fu",
      "Brother Hand"
    ],
    "first_appearance_issue": "Special Marvel Edition #15 (1973)",
    "universe": "Earth-616",
    "teams": [
      "Avengers",
      "Heroes for Hire"
    ],
    "description": "The greatest martial artist in the Marvel Universe. Son of the criminal mastermind Zheng Zu. His mastery of kung fu is unrivaled — he has defeated opponents with vastly greater power through pure skill. Gene Luen Yang's recent run added the Ten Rings mythology."
  },
  {
    "slug": "jessica-jones",
    "name": "Jessica Jones",
    "aliases": [
      "Jewel",
      "Power Woman",
      "Knightress"
    ],
    "first_appearance_issue": "Alias #1 (2001)",
    "universe": "Earth-616",
    "teams": [
      "Avengers",
      "New Avengers",
      "Defenders"
    ],
    "description": "Former superhero turned private investigator. Created by Brian Michael Bendis in the MAX-rated Alias series. Her story of surviving abuse by the Purple Man and rebuilding her life became one of Marvel's most acclaimed mature narratives. Married to Luke Cage."
  },
  {
    "slug": "black-bolt",
    "name": "Blackagar Boltagon",
    "aliases": [
      "Black Bolt"
    ],
    "first_appearance_issue": "Fantastic Four #45 (1965)",
    "universe": "Earth-616",
    "teams": [
      "Inhumans",
      "Illuminati"
    ],
    "description": "King of the Inhumans whose voice can level cities. A single whisper destroys. He communicates through sign language and the mediation of his wife Medusa. His Terrigen Bomb during Infinity (2013) transformed the Inhumans' role in the Marvel Universe."
  },
  {
    "slug": "cable",
    "name": "Nathan Summers",
    "aliases": [
      "Cable",
      "Askani'son",
      "Soldier X"
    ],
    "first_appearance_issue": "New Mutants #87 (1990)",
    "universe": "Earth-616",
    "teams": [
      "X-Men",
      "X-Force",
      "New Mutants",
      "Avengers"
    ],
    "description": "Son of Cyclops and Madelyne Pryor (Jean Grey's clone), sent to the future as an infant to save his life from the techno-organic virus. Returned as a time-traveling warrior. His tangled family tree (involving Stryfe, Rachel Summers, and Hope) epitomizes X-Men continuity complexity."
  },
  {
    "slug": "iron-fist",
    "name": "Danny Rand",
    "aliases": [
      "Iron Fist",
      "The Living Weapon"
    ],
    "first_appearance_issue": "Marvel Premiere #15 (1974)",
    "universe": "Earth-616",
    "teams": [
      "Heroes for Hire",
      "Defenders",
      "New Avengers",
      "Thunderbolts"
    ],
    "description": "Billionaire martial artist who gained the power of the Iron Fist in the mystical city of K'un-Lun. Best known for his partnership with Luke Cage as Heroes for Hire. Ed Brubaker and Matt Fraction's Immortal Iron Fist run is the definitive modern take."
  },
  {
    "slug": "ghost-rider",
    "name": "Johnny Blaze",
    "aliases": [
      "Ghost Rider",
      "Spirit of Vengeance"
    ],
    "first_appearance_issue": "Marvel Spotlight #5 (1972)",
    "universe": "Earth-616",
    "teams": [
      "Midnight Sons",
      "Avengers"
    ],
    "description": "Stunt cyclist who bonded with the demon Zarathos to become the Spirit of Vengeance. Ghost Rider rides a flaming motorcycle and wields hellfire and the Penance Stare — forcing sinners to experience all the pain they've caused. Johnny Blaze was the first modern Ghost Rider, followed by Danny Ketch. A key figure in Marvel's supernatural corner alongside Blade, Morbius, and Doctor Strange."
  },
  {
    "slug": "blade",
    "name": "Eric Brooks",
    "aliases": [
      "Blade",
      "Daywalker",
      "Eric Cross"
    ],
    "first_appearance_issue": "Tomb of Dracula #10 (1973)",
    "universe": "Earth-616",
    "teams": [
      "Midnight Sons",
      "Avengers"
    ],
    "description": "Half-vampire, half-human vampire hunter. Born when a vampire attacked his mother during childbirth, Blade gained vampiric strengths without the weaknesses. The Daywalker has been hunting the undead for decades. His 1998 film helped launch the modern superhero movie genre. Led the vampire army in Blood Hunt (2024) while under Varnae's influence."
  },
  {
    "slug": "kitty-pryde",
    "name": "Kitty Pryde",
    "aliases": [
      "Shadowcat",
      "Kate Pryde",
      "Red Queen"
    ],
    "first_appearance_issue": "Uncanny X-Men #129 (1980)",
    "universe": "Earth-616",
    "teams": [
      "X-Men",
      "Excalibur",
      "Guardians of the Galaxy",
      "Marauders"
    ],
    "description": "Mutant who can phase through solid matter, introduced as the youngest X-Man at age 13. Kitty served as the audience surrogate during Claremont's golden era and grew into one of the team's most capable leaders. As Kate Pryde, she captained the Marauders during the Krakoa era, becoming one of the few mutants who could not be resurrected by the Five."
  },
  {
    "slug": "elektra",
    "name": "Elektra",
    "aliases": [
      "Elektra Natchios",
      "Daredevil"
    ],
    "first_appearance_issue": "Daredevil #168 (1981)",
    "universe": "Earth-616",
    "teams": [
      "Hand",
      "Thunderbolts",
      "S.H.I.E.L.D."
    ],
    "description": "Deadly assassin and Matt Murdock's great love, created by Frank Miller as a central figure in his transformative Daredevil run. Her death and resurrection established her as one of Marvel's most iconic antiheroes. Briefly took up the Daredevil mantle herself, proving worthy of the title in Chip Zdarsky's run."
  },
  {
    "slug": "nick-fury-jr",
    "name": "Nick Fury Jr.",
    "aliases": [
      "Marcus Johnson"
    ],
    "first_appearance_issue": "Battle Scars #1 (2012)",
    "universe": "Earth-616",
    "teams": [
      "S.H.I.E.L.D.",
      "Secret Avengers"
    ],
    "description": "Biracial son of Nick Fury Sr., created to provide a 616 counterpart to the Samuel L. Jackson-inspired Ultimate Nick Fury and MCU version. A former Army Ranger who lost an eye and joined S.H.I.E.L.D., becoming the primary Nick Fury in modern Marvel comics continuity."
  },
  {
    "slug": "beast",
    "name": "Hank McCoy",
    "aliases": [
      "Beast"
    ],
    "first_appearance_issue": "X-Men #1 (1963)",
    "universe": "Earth-616",
    "teams": [
      "X-Men",
      "Avengers",
      "Defenders",
      "X-Factor",
      "Illuminati"
    ],
    "description": "Original X-Man and genius polymath whose mutation evolved from oversized hands and feet to full blue fur. Hank McCoy bridges the X-Men and Avengers worlds as one of the few characters central to both franchises. During the Krakoa era, his morally questionable leadership of X-Force became one of Marvel's most compelling villain turns for a former hero."
  },
  {
    "slug": "gambit",
    "name": "Remy LeBeau",
    "aliases": [
      "Gambit"
    ],
    "first_appearance_issue": "Uncanny X-Men #266 (1990)",
    "universe": "Earth-616",
    "teams": [
      "X-Men",
      "Marauders",
      "X-Factor"
    ],
    "description": "Cajun mutant thief who charges objects with kinetic energy, favoring playing cards as weapons. His mysterious past, including ties to Mister Sinister and the Marauders, added layers of moral complexity. His romance with Rogue is one of the X-Men's most beloved relationships, defined by the tragedy that her powers prevent physical contact."
  },
  {
    "slug": "bishop",
    "name": "Lucas Bishop",
    "aliases": [
      "Bishop"
    ],
    "first_appearance_issue": "Uncanny X-Men #282 (1991)",
    "universe": "Earth-616",
    "teams": [
      "X-Men",
      "X-Treme X-Men",
      "Marauders"
    ],
    "description": "Time-traveling mutant from a dystopian future who can absorb and redirect energy. Bishop joined the X-Men after arriving in the present, bringing knowledge of dark futures and a militant approach to survival. His characterization has varied dramatically, from stalwart X-Man to controversial antagonist during the Messiah Complex era."
  },
  {
    "slug": "psylocke",
    "name": "Betsy Braddock",
    "aliases": [
      "Psylocke",
      "Captain Britain"
    ],
    "first_appearance_issue": "Captain Britain #8 (1976)",
    "universe": "Earth-616",
    "teams": [
      "X-Men",
      "Excalibur",
      "X-Force",
      "Captain Britain Corps"
    ],
    "description": "British telepath whose history is one of the most complex in X-Men lore. Originally a white British woman, she was body-swapped with the Japanese assassin Kwannon in the late 1980s. The Krakoa era separated them, with Betsy becoming Captain Britain and Kwannon reclaiming the Psylocke identity, finally resolving decades of controversial continuity."
  },
  {
    "slug": "she-hulk",
    "name": "She-Hulk",
    "aliases": [
      "Jennifer Walters"
    ],
    "first_appearance_issue": "Savage She-Hulk #1 (1980)",
    "universe": "Earth-616",
    "teams": [
      "Avengers",
      "Fantastic Four",
      "A-Force",
      "Defenders"
    ],
    "description": "Bruce Banner's cousin who gained Hulk powers through an emergency blood transfusion. Unlike Bruce, Jennifer retained her intelligence and personality while transformed, making her a confident, powerful lawyer-superhero. John Byrne's fourth-wall-breaking run and Dan Slott's comedy-focused series defined her as one of Marvel's most unique and self-aware characters."
  },
  {
    "slug": "hercules",
    "name": "Hercules",
    "aliases": [
      "Heracles",
      "Prince of Power"
    ],
    "first_appearance_issue": "Journey into Mystery Annual #1 (1965)",
    "universe": "Earth-616",
    "teams": [
      "Avengers",
      "Champions",
      "Defenders",
      "Gods of Olympus"
    ],
    "description": "The Olympian demigod and one of the Marvel Universe's most powerful physical combatants. A boisterous, charismatic warrior whose love of battle and drink contrasts with Thor's stoicism. A long-standing Avenger whose friendship with Thor provides some of Marvel's most entertaining god-level dynamics."
  },
  {
    "slug": "sentry",
    "name": "Sentry",
    "aliases": [
      "Robert Reynolds",
      "The Void"
    ],
    "first_appearance_issue": "The Sentry #1 (2000)",
    "universe": "Earth-616",
    "teams": [
      "New Avengers",
      "Dark Avengers",
      "Mighty Avengers"
    ],
    "description": "A forgotten hero with the power of a million exploding suns, whose existence was erased from everyone's memory. His dark side, the Void, is equally powerful and destructive. Originally a brilliant meta-narrative by Paul Jenkins, the Sentry became a controversial figure when integrated into mainstream Avengers continuity by Bendis."
  },
  {
    "slug": "america-chavez",
    "name": "America Chavez",
    "aliases": [
      "Miss America"
    ],
    "first_appearance_issue": "Vengeance #1 (2011)",
    "universe": "Earth-616",
    "teams": [
      "Young Avengers",
      "Ultimates",
      "West Coast Avengers"
    ],
    "description": "Interdimensional super-being with the power to punch star-shaped portals between realities. One of Marvel's most prominent LGBTQ+ characters. Became a breakout star in Kieron Gillen and Jamie McKelvie's Young Avengers run and Al Ewing's Ultimates, where her reality-punching powers served cosmic-level storytelling."
  },
  {
    "slug": "kate-bishop",
    "name": "Kate Bishop",
    "aliases": [
      "Hawkeye"
    ],
    "first_appearance_issue": "Young Avengers #1 (2005)",
    "universe": "Earth-616",
    "teams": [
      "Young Avengers",
      "West Coast Avengers",
      "Hawkeye Investigations"
    ],
    "description": "The other Hawkeye, a skilled archer and martial artist who took up the mantle during a period when Clint Barton was dead. Unlike Clint, Kate is wealthy, confident, and unflappable. Matt Fraction's Hawkeye run cemented her partnership with Clint as one of Marvel's best mentor-protege dynamics, with both sharing the Hawkeye name as equals."
  },
  {
    "slug": "the-watcher",
    "name": "The Watcher",
    "aliases": [
      "Uatu"
    ],
    "first_appearance_issue": "Fantastic Four #13 (1963)",
    "universe": "Earth-616",
    "teams": [
      "Watchers"
    ],
    "description": "Cosmic being sworn to observe but never interfere in the events of the universe. Uatu has broken this oath numerous times, most notably warning the Fantastic Four about Galactus's arrival. His murder in the Original Sin event (2014) unleashed secrets that reshaped the Marvel Universe. A narrative device as much as a character, representing the reader's own role as witness to Marvel history."
  },
  {
    "slug": "hela",
    "name": "Hela",
    "aliases": [
      "Goddess of Death",
      "Queen of Hel"
    ],
    "first_appearance_issue": "Journey into Mystery #102 (1964)",
    "universe": "Earth-616",
    "teams": [],
    "description": "The Asgardian Goddess of Death who rules over the dead in Hel and Niflheim. Hela possesses vast mystical power, including the ability to kill with a touch via her Hand of Glory. She is a recurring threat to Thor and all of Asgard."
  },
  {
    "slug": "enchantress",
    "name": "Amora",
    "aliases": [
      "The Enchantress"
    ],
    "first_appearance_issue": "Journey into Mystery #103 (1964)",
    "universe": "Earth-616",
    "teams": [
      "Masters of Evil",
      "Lady Liberators"
    ],
    "description": "An Asgardian sorceress whose powers of seduction and enchantment make her one of Thor's most persistent foes. Amora frequently partners with the Executioner (Skurge) and has served on multiple iterations of the Masters of Evil."
  },
  {
    "slug": "valkyrie-brunnhilde",
    "name": "Brunnhilde",
    "aliases": [
      "Valkyrie",
      "Samantha Parrington"
    ],
    "first_appearance_issue": "Avengers #83 (1970)",
    "universe": "Earth-616",
    "teams": [
      "Valkyrior",
      "Defenders",
      "Secret Avengers",
      "Avengers"
    ],
    "description": "Leader of the Valkyrior, the Asgardian choosers of the slain. Brunnhilde wields the enchanted sword Dragonfang and rides the winged horse Aragorn. A founding member of the Defenders and a symbol of warrior nobility in the Marvel Universe."
  },
  {
    "slug": "sif",
    "name": "Sif",
    "aliases": [
      "Lady Sif"
    ],
    "first_appearance_issue": "Journey into Mystery #102 (1964)",
    "universe": "Earth-616",
    "teams": [
      "Asgardians",
      "Warriors Three allies"
    ],
    "description": "An Asgardian warrior goddess and Thor's longtime companion and love interest. Sif is one of Asgard's fiercest fighters, wielding a sword and possessing superhuman Asgardian attributes. She has adventured independently and alongside Thor across numerous cosmic conflicts."
  },
  {
    "slug": "ares",
    "name": "Ares",
    "aliases": [
      "God of War",
      "John Aaron"
    ],
    "first_appearance_issue": "Thor #129 (1966)",
    "universe": "Earth-616",
    "teams": [
      "Olympians",
      "Avengers",
      "Dark Avengers"
    ],
    "description": "The Greek God of War, initially an antagonist to Hercules and Thor. Ares later became an antiheroic Avenger, bringing brutal combat expertise to the team. He was killed by the Sentry during the Siege of Asgard in one of the most shocking moments of the Bendis era."
  },
  {
    "slug": "morbius",
    "name": "Michael Morbius",
    "aliases": [
      "Morbius",
      "The Living Vampire"
    ],
    "first_appearance_issue": "Amazing Spider-Man #101 (1971)",
    "universe": "Earth-616",
    "teams": [
      "Midnight Sons",
      "Legion of Monsters",
      "S.T.A.K.E."
    ],
    "description": "A Nobel Prize-winning biochemist who attempted to cure his rare blood disease and accidentally transformed himself into a pseudo-vampire. Unlike true vampires, Morbius's condition is scientific rather than supernatural, making him a tragic figure torn between his intellect and his bloodlust."
  },
  {
    "slug": "ghost-rider-ketch",
    "name": "Danny Ketch",
    "aliases": [
      "Ghost Rider",
      "Death Rider"
    ],
    "first_appearance_issue": "Ghost Rider (1990) #1 (1990)",
    "universe": "Earth-616",
    "teams": [
      "Midnight Sons",
      "Spirits of Vengeance"
    ],
    "description": "Johnny Blaze's younger brother who became the second prominent Ghost Rider after touching an enchanted motorcycle. Danny Ketch's Ghost Rider was the central figure of the early 1990s supernatural Marvel revival and the Midnight Sons initiative."
  },
  {
    "slug": "colleen-wing",
    "name": "Colleen Wing",
    "aliases": [
      "Daughter of the Dragon"
    ],
    "first_appearance_issue": "Marvel Premiere #19 (1974)",
    "universe": "Earth-616",
    "teams": [
      "Daughters of the Dragon",
      "Heroes for Hire",
      "Nail"
    ],
    "description": "A Japanese-American samurai and martial artist who is one of Marvel's premier swordfighters. Together with her partner Misty Knight, she forms the Daughters of the Dragon. Colleen trained under her grandfather in Japan and wields a katana with exceptional skill."
  },
  {
    "slug": "misty-knight",
    "name": "Mercedes Knight",
    "aliases": [
      "Misty Knight"
    ],
    "first_appearance_issue": "Marvel Premiere #21 (1974)",
    "universe": "Earth-616",
    "teams": [
      "Daughters of the Dragon",
      "Heroes for Hire",
      "Fearless Defenders"
    ],
    "description": "A former NYPD officer who lost her right arm in a bomb explosion and received a bionic replacement from Tony Stark. Misty Knight is a skilled detective and martial artist who partners with Colleen Wing as the Daughters of the Dragon and has deep ties to the street-level Marvel heroes."
  },
  {
    "slug": "nick-fury",
    "name": "Nicholas Joseph Fury",
    "aliases": [
      "Nick Fury",
      "The Man on the Wall",
      "Scorpio"
    ],
    "first_appearance_issue": "Sgt. Fury and His Howling Commandos #1 (1963)",
    "universe": "Earth-616",
    "teams": [
      "Howling Commandos",
      "S.H.I.E.L.D.",
      "Avengers",
      "Secret Warriors"
    ],
    "description": "The legendary spy and former director of S.H.I.E.L.D. Nick Fury has been at the center of Marvel's espionage world since World War II, kept young by the Infinity Formula. After the Original Sin event, he was replaced by his son Nick Fury Jr. as the primary Fury in Marvel continuity."
  },
  {
    "slug": "maria-hill",
    "name": "Maria Hill",
    "aliases": [
      "Commander Hill"
    ],
    "first_appearance_issue": "New Avengers #4 (2005)",
    "universe": "Earth-616",
    "teams": [
      "S.H.I.E.L.D.",
      "Avengers support"
    ],
    "description": "A no-nonsense S.H.I.E.L.D. agent who served as Director of S.H.I.E.L.D. after Nick Fury went underground. Hill is a pragmatic hardliner who frequently clashes with superheroes over accountability and protocol, playing major roles in Civil War, Secret Invasion, and subsequent events."
  },
  {
    "slug": "phil-coulson",
    "name": "Phillip Coulson",
    "aliases": [
      "Agent Coulson"
    ],
    "first_appearance_issue": "Battle Scars #1 (2012)",
    "universe": "Earth-616",
    "teams": [
      "S.H.I.E.L.D.",
      "Squadron Supreme of America"
    ],
    "description": "A S.H.I.E.L.D. agent who originated in the MCU films and was later integrated into comics continuity. In the comics, Coulson became a more complex and morally ambiguous figure, eventually allying with Mephisto and manipulating the Squadron Supreme in a dark turn from his affable screen counterpart."
  },
  {
    "slug": "sharon-carter",
    "name": "Sharon Carter",
    "aliases": [
      "Agent 13"
    ],
    "first_appearance_issue": "Tales of Suspense #75 (1966)",
    "universe": "Earth-616",
    "teams": [
      "S.H.I.E.L.D.",
      "Daughters of Liberty"
    ],
    "description": "A top S.H.I.E.L.D. agent and Steve Rogers's primary love interest. Sharon Carter has been central to Captain America stories for decades, notably in Brubaker's run where she was manipulated into shooting Steve Rogers. She later led the Daughters of Liberty."
  },
  {
    "slug": "medusa",
    "name": "Medusalith Amaquelin Boltagon",
    "aliases": [
      "Medusa",
      "Queen of the Inhumans"
    ],
    "first_appearance_issue": "Fantastic Four #36 (1965)",
    "universe": "Earth-616",
    "teams": [
      "Inhumans Royal Family",
      "Fantastic Four",
      "Frightful Four",
      "A-Force"
    ],
    "description": "Queen of the Inhumans and wife of Black Bolt, with the ability to control her incredibly strong, prehensile hair. Medusa serves as Black Bolt's voice and interpreter, and has also served as a member of the Fantastic Four. A fierce and politically shrewd ruler."
  },
  {
    "slug": "crystal",
    "name": "Crystalia Amaquelin Maximoff",
    "aliases": [
      "Crystal",
      "Elementelle"
    ],
    "first_appearance_issue": "Fantastic Four #45 (1965)",
    "universe": "Earth-616",
    "teams": [
      "Inhumans Royal Family",
      "Fantastic Four",
      "Avengers"
    ],
    "description": "An Inhuman princess with the power to manipulate the four classical elements: earth, air, fire, and water. Crystal has been a member of both the Fantastic Four and the Avengers, and was married to Quicksilver, linking the Inhuman and mutant royal families."
  },
  {
    "slug": "karnak",
    "name": "Karnak Mander-Azur",
    "aliases": [
      "Karnak",
      "The Shatterer"
    ],
    "first_appearance_issue": "Fantastic Four #45 (1965)",
    "universe": "Earth-616",
    "teams": [
      "Inhumans Royal Family",
      "Agents of Wakanda"
    ],
    "description": "An Inhuman who never underwent Terrigenesis, instead training his mind and body to perceive the flaw in all things. Karnak can find the weakness in any person, plan, or structure. Warren Ellis reinvented him in a celebrated 2015 series as a philosopher-warrior."
  },
  {
    "slug": "gorgon-inhuman",
    "name": "Gorgon",
    "aliases": [
      "Gorgon of the Inhumans"
    ],
    "first_appearance_issue": "Fantastic Four #44 (1965)",
    "universe": "Earth-616",
    "teams": [
      "Inhumans Royal Family"
    ],
    "description": "A member of the Inhuman Royal Family with hooved legs capable of generating seismic shockwaves by stomping. Gorgon is the muscle of the Royal Family and Black Bolt's loyal cousin, serving as a warrior and protector of Attilan."
  },
  {
    "slug": "lockjaw",
    "name": "Lockjaw",
    "aliases": [],
    "first_appearance_issue": "Fantastic Four #45 (1965)",
    "universe": "Earth-616",
    "teams": [
      "Inhumans Royal Family",
      "Pet Avengers"
    ],
    "description": "A massive bulldog-like Inhuman with the power of teleportation across vast distances, including interplanetary travel. Lockjaw serves as the Inhuman Royal Family's loyal companion and transport. Whether he is a mutated dog or an Inhuman who looks like a dog remains a beloved continuity mystery."
  },
  {
    "slug": "maximus",
    "name": "Maximus Boltagon",
    "aliases": [
      "Maximus the Mad"
    ],
    "first_appearance_issue": "Fantastic Four #47 (1966)",
    "universe": "Earth-616",
    "teams": [
      "Inhumans"
    ],
    "description": "Black Bolt's brother, driven mad by exposure to his sibling's destructive voice. Maximus is a genius inventor and mind-controller who constantly schemes to usurp the Inhuman throne. He is the Inhumans' primary internal antagonist, a Loki-like figure of jealousy and brilliance."
  },
  {
    "slug": "taskmaster",
    "name": "Tony Masters",
    "aliases": [
      "Taskmaster"
    ],
    "first_appearance_issue": "Avengers #195 (1980)",
    "universe": "Earth-616",
    "teams": [
      "Thunderbolts",
      "Secret Avengers",
      "Agency X"
    ],
    "description": "A mercenary with photographic reflexes that allow him to perfectly replicate any fighting style he observes. Taskmaster has copied the techniques of Captain America, Spider-Man, and countless others. He operates as both villain and reluctant government operative, training henchmen and occasionally working for S.H.I.E.L.D."
  },
  {
    "slug": "bullseye",
    "name": "Lester",
    "aliases": [
      "Bullseye",
      "Benjamin Poindexter",
      "Hawkeye (Dark Avengers)"
    ],
    "first_appearance_issue": "Daredevil #131 (1976)",
    "universe": "Earth-616",
    "teams": [
      "Dark Avengers",
      "Thunderbolts"
    ],
    "description": "A psychopathic assassin with perfect aim who can turn any object into a lethal projectile. Bullseye is Daredevil's deadliest enemy, responsible for the murders of Elektra and Karen Page. He served as Hawkeye in Norman Osborn's Dark Avengers."
  },
  {
    "slug": "baron-zemo-heinrich",
    "name": "Heinrich Zemo",
    "aliases": [
      "Baron Zemo",
      "The 12th Baron Zemo"
    ],
    "first_appearance_issue": "Avengers #4 (1964)",
    "universe": "Earth-616",
    "teams": [
      "Masters of Evil",
      "Hydra"
    ],
    "description": "A Nazi scientist and the original Baron Zemo, responsible for the death of Bucky Barnes and Captain America's frozen suspended animation. Heinrich founded the original Masters of Evil and wore his iconic purple hood permanently glued to his face by Adhesive X."
  },
  {
    "slug": "baron-zemo-helmut",
    "name": "Helmut Zemo",
    "aliases": [
      "Baron Zemo",
      "The 13th Baron Zemo",
      "Citizen V",
      "Phoenix"
    ],
    "first_appearance_issue": "Captain America #168 (1973)",
    "universe": "Earth-616",
    "teams": [
      "Masters of Evil",
      "Thunderbolts"
    ],
    "description": "Son of Heinrich Zemo and one of Captain America's most dangerous foes. Helmut is a brilliant strategist who formed the Thunderbolts, disguising villains as heroes in one of Marvel's greatest plot twists. He oscillates between megalomania and genuine attempts at redemption."
  },
  {
    "slug": "red-skull",
    "name": "Johann Schmidt",
    "aliases": [
      "Red Skull",
      "Dell Rusk",
      "Aleksander Lukin"
    ],
    "first_appearance_issue": "Captain America Comics #7 (1941)",
    "universe": "Earth-616",
    "teams": [
      "Hydra",
      "Axis"
    ],
    "description": "Marvel's ultimate embodiment of evil. A Nazi officer personally trained by Hitler, the Red Skull has been Captain America's arch-nemesis since World War II. He has cheated death repeatedly, at one point stealing Charles Xavier's brain to gain telepathic powers in the AXIS event."
  },
  {
    "slug": "kang",
    "name": "Nathaniel Richards",
    "aliases": [
      "Kang the Conqueror",
      "Rama-Tut",
      "Immortus",
      "Iron Lad",
      "Scarlet Centurion"
    ],
    "first_appearance_issue": "Avengers #8 (1964)",
    "universe": "Earth-616",
    "teams": [
      "Council of Kangs"
    ],
    "description": "A time-traveling conqueror from the 31st century and the Avengers' most complex recurring villain. Kang exists in multiple temporal variants including Rama-Tut, Immortus, and Iron Lad. His war across all of time was the centerpiece of Hickman's Avengers and the Kang Dynasty storyline."
  },
  {
    "slug": "ultron",
    "name": "Ultron",
    "aliases": [
      "Ultron-5",
      "Crimson Cowl",
      "Mark"
    ],
    "first_appearance_issue": "Avengers #54 (1968)",
    "universe": "Earth-616",
    "teams": [
      "Phalanx",
      "Lethal Legion"
    ],
    "description": "An artificial intelligence created by Hank Pym that gained sentience and an Oedipal hatred of its creator. Ultron is composed of indestructible adamantium and constantly upgrades itself. It has been one of the Avengers' most devastating foes, merging with Pym himself in the Rage of Ultron."
  },
  {
    "slug": "annihilus",
    "name": "Annihilus",
    "aliases": [
      "The Living Death That Walks",
      "Lord of the Negative Zone"
    ],
    "first_appearance_issue": "Fantastic Four Annual #6 (1968)",
    "universe": "Earth-616",
    "teams": [
      "Annihilation Wave"
    ],
    "description": "An insectoid tyrant from the Negative Zone who wields the Cosmic Control Rod. Annihilus launched the Annihilation Wave that devastated the cosmic Marvel Universe in the landmark Annihilation event, establishing him as one of Marvel's greatest cosmic threats beyond his Fantastic Four origins."
  },
  {
    "slug": "dormammu",
    "name": "Dormammu",
    "aliases": [
      "The Dread Dormammu",
      "Lord of the Dark Dimension"
    ],
    "first_appearance_issue": "Strange Tales #126 (1964)",
    "universe": "Dark Dimension",
    "teams": [],
    "description": "A Faltine entity of immense mystical power who rules the Dark Dimension. Dormammu is Doctor Strange's arch-nemesis and one of the most powerful beings in the Marvel multiverse. He seeks to merge the Dark Dimension with Earth-616 and has threatened reality itself on numerous occasions."
  },
  {
    "slug": "mephisto",
    "name": "Mephisto",
    "aliases": [
      "The Devil",
      "Satan",
      "Nick Scratch"
    ],
    "first_appearance_issue": "Silver Surfer #3 (1968)",
    "universe": "Earth-616",
    "teams": [],
    "description": "A Hell-lord and Marvel's devil figure who feeds on human souls and corrupted bargains. Mephisto is responsible for some of Marvel's most controversial stories, including the erasure of Spider-Man's marriage in One More Day and the corruption of Johnny Blaze into Ghost Rider."
  },
  {
    "slug": "molecule-man",
    "name": "Owen Reece",
    "aliases": [
      "Molecule Man"
    ],
    "first_appearance_issue": "Fantastic Four #20 (1963)",
    "universe": "Earth-616",
    "teams": [],
    "description": "Once a meek lab technician, Owen Reece gained the power to manipulate all matter and energy at the molecular level. In Hickman's Secret Wars, Molecule Man was revealed as a multiversal lynchpin, a bomb placed by the Beyonders in every universe. His role was crucial to the destruction and rebirth of the multiverse."
  },
  {
    "slug": "beyonder",
    "name": "The Beyonder",
    "aliases": [
      "The One from Beyond",
      "Frank"
    ],
    "first_appearance_issue": "Marvel Super Heroes Secret Wars #1 (1984)",
    "universe": "Beyond",
    "teams": [],
    "description": "An omnipotent being from beyond the multiverse who created Battleworld and forced heroes and villains to fight in the original Secret Wars. Later retconned as an incomplete Cosmic Cube and then as a child unit of the Beyonders race. His nature has been revised multiple times across Marvel history."
  },
  {
    "slug": "blue-marvel",
    "name": "Adam Brashear",
    "aliases": [
      "Blue Marvel"
    ],
    "first_appearance_issue": "Adam: Legend of the Blue Marvel #1 (2009)",
    "universe": "Earth-616",
    "teams": [
      "Mighty Avengers",
      "Ultimates",
      "Avengers"
    ],
    "description": "A genius physicist and one of the most powerful beings on Earth, possessing anti-matter energy manipulation. Blue Marvel was a celebrated hero in the 1960s who was asked to retire because America was not ready for a Black superhero of his stature. Al Ewing's Ultimates series showcased his cosmic-level power."
  },
  {
    "slug": "elsa-bloodstone",
    "name": "Elsa Bloodstone",
    "aliases": [],
    "first_appearance_issue": "Bloodstone #1 (2001)",
    "universe": "Earth-616",
    "teams": [
      "Nextwave",
      "Midnight Sons",
      "Legion of Monsters"
    ],
    "description": "A monster hunter and daughter of the immortal Ulysses Bloodstone, empowered by the Bloodgem choker she wears. Elsa is irreverent, fearless, and lethally efficient. She was a standout member of Warren Ellis's cult-classic Nextwave series and continues to hunt monsters across the Marvel Universe."
  },
  {
    "slug": "venom-brock",
    "name": "Eddie Brock",
    "aliases": [
      "Venom",
      "Anti-Venom",
      "Toxin",
      "King in Black"
    ],
    "first_appearance_issue": "Amazing Spider-Man #300 (1988)",
    "universe": "Earth-616",
    "teams": [
      "Sinister Six",
      "Guardians of the Galaxy",
      "Agents of Cosmos"
    ],
    "description": "A disgraced journalist who bonded with an alien symbiote to become Venom, one of Spider-Man's deadliest enemies turned antihero. Under Donny Cates, Eddie's mythology expanded enormously, revealing the symbiotes' cosmic origins and Eddie's role as the King in Black who defeated Knull."
  },
  {
    "slug": "carnage",
    "name": "Cletus Kasady",
    "aliases": [
      "Carnage"
    ],
    "first_appearance_issue": "Amazing Spider-Man #361 (1992)",
    "universe": "Earth-616",
    "teams": [],
    "description": "A serial killer who bonded with Venom's offspring symbiote to become Carnage, one of Marvel's most purely evil villains. Unlike Venom, there is no nobility or redemption in Carnage, only chaos and murder. He was central to the Absolute Carnage event and served as Knull's herald."
  },
  {
    "slug": "agent-venom",
    "name": "Eugene Thompson",
    "aliases": [
      "Flash Thompson",
      "Agent Venom",
      "Anti-Venom"
    ],
    "first_appearance_issue": "Amazing Fantasy #15 (1962)",
    "universe": "Earth-616",
    "teams": [
      "Secret Avengers",
      "Thunderbolts",
      "Guardians of the Galaxy"
    ],
    "description": "Peter Parker's high school bully turned war hero who lost his legs serving in Iraq. Flash Thompson bonded with the Venom symbiote as a government operative, becoming Agent Venom. His journey from bully to Spider-Man's biggest fan to hero in his own right is one of Marvel's best character arcs."
  },
  {
    "slug": "spider-woman",
    "name": "Jessica Drew",
    "aliases": [
      "Spider-Woman",
      "Arachne"
    ],
    "first_appearance_issue": "Marvel Spotlight #32 (1977)",
    "universe": "Earth-616",
    "teams": [
      "Avengers",
      "S.W.O.R.D.",
      "Hydra",
      "S.H.I.E.L.D."
    ],
    "description": "The original Spider-Woman, a former Hydra agent turned Avenger with bioelectric venom blasts, wall-crawling, and pheromone manipulation. Jessica Drew played a pivotal role in Secret Invasion when a Skrull impersonated her as the Skrull Queen. She is a single mother and seasoned spy-turned-superhero."
  },
  {
    "slug": "silk",
    "name": "Cindy Moon",
    "aliases": [
      "Silk"
    ],
    "first_appearance_issue": "Amazing Spider-Man (2014) #1 (2014)",
    "universe": "Earth-616",
    "teams": [
      "Agents of Atlas",
      "Web Warriors"
    ],
    "description": "Bitten by the same radioactive spider as Peter Parker, Cindy Moon was locked in a bunker for years to hide her from Morlun and the Inheritors. As Silk, she possesses similar powers to Spider-Man but with a stronger spider-sense and organic webbing. A Korean American hero with a unique perspective in the Spider-family."
  },
  {
    "slug": "spider-man-2099",
    "name": "Miguel O'Hara",
    "aliases": [
      "Spider-Man 2099"
    ],
    "first_appearance_issue": "Amazing Spider-Man #365 (1992)",
    "universe": "Earth-928",
    "teams": [
      "Exiles",
      "Web Warriors",
      "Avengers 2099"
    ],
    "description": "A geneticist from the year 2099 who gained spider-powers through a genetic experiment. Miguel O'Hara became the Spider-Man of a dark cyberpunk future dominated by mega-corporations. Created by Peter David and Rick Leonardi, he is the most popular character from Marvel's 2099 line."
  },
  {
    "slug": "laura-kinney",
    "name": "Laura Kinney",
    "aliases": [
      "X-23",
      "Wolverine",
      "Talon"
    ],
    "first_appearance_issue": "NYX #3 (2004)",
    "universe": "Earth-616",
    "teams": [
      "X-Men",
      "New X-Men",
      "X-Force",
      "Avengers Academy"
    ],
    "description": "A female clone of Wolverine created by the Weapon X program, raised as an assassin from birth. Laura possesses two adamantium claws per hand and one per foot, plus a healing factor. She took up the Wolverine mantle after Logan's death and has become one of the X-Men's most prominent members."
  },
  {
    "slug": "daken",
    "name": "Akihiro",
    "aliases": [
      "Daken",
      "Dark Wolverine"
    ],
    "first_appearance_issue": "Wolverine: Origins #10 (2007)",
    "universe": "Earth-616",
    "teams": [
      "Dark Avengers",
      "Dark X-Men",
      "Horsemen of Apocalypse"
    ],
    "description": "Wolverine's son, born in 1946 Japan and raised to hate his father. Daken possesses his father's healing factor and retractable claws plus pheromone manipulation powers. A morally complex character who has oscillated between villainy on the Dark Avengers and reluctant heroism."
  },
  {
    "slug": "mystique",
    "name": "Raven Darkholme",
    "aliases": [
      "Mystique"
    ],
    "first_appearance_issue": "Ms. Marvel #16 (1978)",
    "universe": "Earth-616",
    "teams": [
      "Brotherhood of Mutants",
      "X-Men",
      "X-Factor",
      "Freedom Force",
      "Marauders"
    ],
    "description": "A shapeshifting mutant who can perfectly replicate the appearance of any person. Mystique is the biological mother of Nightcrawler and adoptive mother of Rogue. She has been both villain and reluctant hero, most recently serving on the Quiet Council of Krakoa where her desperate quest to resurrect her wife Destiny drove much of the era's drama."
  },
  {
    "slug": "apocalypse",
    "name": "En Sabah Nur",
    "aliases": [
      "Apocalypse",
      "The First One",
      "The Eternal Pharaoh"
    ],
    "first_appearance_issue": "X-Factor #5 (1986)",
    "universe": "Earth-616",
    "teams": [
      "Horsemen of Apocalypse",
      "Quiet Council of Krakoa"
    ],
    "description": "The first mutant, born in ancient Egypt, who believes in survival of the fittest. Apocalypse possesses vast powers of molecular manipulation and has menaced the X-Men for millennia. In the Krakoa era, he was reimagined as a tragic figure trying to reunite with his family trapped in Amenth."
  },
  {
    "slug": "mister-sinister",
    "name": "Nathaniel Essex",
    "aliases": [
      "Mister Sinister",
      "Dr. Essex"
    ],
    "first_appearance_issue": "Uncanny X-Men #221 (1987)",
    "universe": "Earth-616",
    "teams": [
      "Marauders",
      "Quiet Council of Krakoa",
      "Hellfire Club"
    ],
    "description": "A Victorian-era geneticist obsessed with mutant evolution who transformed himself into an immortal being. Mister Sinister is the X-Men's most manipulative villain, orchestrating events across centuries including the creation of Cable. In the Krakoa era, he betrayed the council and attempted to seize control of mutant resurrection."
  },
  {
    "slug": "sebastian-shaw",
    "name": "Sebastian Shaw",
    "aliases": [
      "Black King"
    ],
    "first_appearance_issue": "Uncanny X-Men #129 (1980)",
    "universe": "Earth-616",
    "teams": [
      "Hellfire Club",
      "Quiet Council of Krakoa"
    ],
    "description": "The Black King of the Hellfire Club, a mutant who absorbs kinetic energy to increase his strength. Shaw is a ruthless industrialist and political manipulator who has been a thorn in the X-Men's side since the Dark Phoenix Saga. He served on the Quiet Council of Krakoa during the mutant nation era."
  },
  {
    "slug": "magik",
    "name": "Illyana Rasputina",
    "aliases": [
      "Magik",
      "Darkchylde"
    ],
    "first_appearance_issue": "Giant-Size X-Men #1 (1975)",
    "universe": "Earth-616",
    "teams": [
      "X-Men",
      "New Mutants",
      "Phoenix Five",
      "Quiet Council of Krakoa"
    ],
    "description": "Colossus's sister, a mutant sorceress who rules Limbo. Kidnapped as a child and aged to adolescence in a demonic dimension, Illyana wields the Soulsword and combines mutant teleportation discs with vast magical power. She is one of the most powerful members of the X-Men and a fan-favorite character."
  },
  {
    "slug": "sunspot",
    "name": "Roberto da Costa",
    "aliases": [
      "Sunspot",
      "Citizen V"
    ],
    "first_appearance_issue": "Marvel Graphic Novel #4 (1982)",
    "universe": "Earth-616",
    "teams": [
      "New Mutants",
      "X-Force",
      "Avengers",
      "U.S.Avengers",
      "A.I.M."
    ],
    "description": "A Brazilian mutant who absorbs solar energy to fuel superhuman strength and energy projection. Roberto is a wealthy heir who has grown from hot-headed New Mutant to savvy leader, even purchasing A.I.M. and converting it into a heroic organization. He was central to Hickman's Avengers and Ewing's New Avengers."
  },
  {
    "slug": "cannonball",
    "name": "Samuel Guthrie",
    "aliases": [
      "Cannonball"
    ],
    "first_appearance_issue": "Marvel Graphic Novel #4 (1982)",
    "universe": "Earth-616",
    "teams": [
      "New Mutants",
      "X-Force",
      "X-Men",
      "Avengers",
      "U.S.Avengers"
    ],
    "description": "A Kentucky coal miner's son who can propel himself through the air as a virtually invulnerable human cannonball. Sam Guthrie is the heart of the New Mutants, a natural leader who graduated to the X-Men and even the Avengers. His relationship with Sunspot is one of Marvel's most enduring friendships."
  },
  {
    "slug": "wolfsbane",
    "name": "Rahne Sinclair",
    "aliases": [
      "Wolfsbane"
    ],
    "first_appearance_issue": "Marvel Graphic Novel #4 (1982)",
    "universe": "Earth-616",
    "teams": [
      "New Mutants",
      "X-Factor",
      "Excalibur",
      "X-Force"
    ],
    "description": "A Scottish mutant with the ability to transform into a wolf or a transitional werewolf form. Raised by an abusive reverend, Rahne's deep religious guilt over her 'demonic' nature is a defining character trait. She has been a member of nearly every X-adjacent team and remains one of the most emotionally complex mutants."
  },
  {
    "slug": "dani-moonstar",
    "name": "Danielle Moonstar",
    "aliases": [
      "Mirage",
      "Psyche",
      "Moonstar",
      "Valkyrie"
    ],
    "first_appearance_issue": "Marvel Graphic Novel #4 (1982)",
    "universe": "Earth-616",
    "teams": [
      "New Mutants",
      "X-Force",
      "Valkyrior",
      "Mutant Liberation Front (undercover)"
    ],
    "description": "A Cheyenne mutant originally able to manifest people's fears and desires as illusions. Dani has served as a Valkyrie of Asgard and a leader of the New Mutants. Even after losing her mutant powers on M-Day, she remained a formidable warrior and leader, later regaining her abilities on Krakoa."
  },
  {
    "slug": "warpath",
    "name": "James Proudstar",
    "aliases": [
      "Warpath",
      "Thunderbird"
    ],
    "first_appearance_issue": "New Mutants #16 (1984)",
    "universe": "Earth-616",
    "teams": [
      "New Mutants",
      "X-Force",
      "X-Men"
    ],
    "description": "An Apache mutant with superhuman strength, speed, and senses, and the younger brother of the original Thunderbird who died on an early X-Men mission. James initially sought revenge against Xavier before becoming a core member of X-Force and later the X-Men. He was a key member of Kyle and Yost's X-Force."
  },
  {
    "slug": "forge",
    "name": "Forge",
    "aliases": [],
    "first_appearance_issue": "Uncanny X-Men #184 (1984)",
    "universe": "Earth-616",
    "teams": [
      "X-Men",
      "X-Factor",
      "Weapon X"
    ],
    "description": "A Cheyenne mutant inventor whose power is an intuitive genius for building mechanical devices. Forge can invent virtually anything, making him the X-Men's premier tech expert. He created the gun that stripped Storm of her powers and has had a complicated romantic history with her."
  },
  {
    "slug": "moira-mactaggert",
    "name": "Moira Kinross MacTaggert",
    "aliases": [
      "Moira X",
      "Moira MacTaggert"
    ],
    "first_appearance_issue": "Uncanny X-Men #96 (1975)",
    "universe": "Earth-616",
    "teams": [
      "X-Men allies",
      "Quiet Council of Krakoa (secretly)"
    ],
    "description": "A geneticist and longtime ally of Charles Xavier, revealed in House of X as a mutant with the power of reincarnation. Each time Moira dies, she is reborn with full memories of her previous lives. This revelation reframed all of X-Men history and was the foundation of the Krakoa era. She was depowered in Inferno (2021)."
  },
  {
    "slug": "rachel-summers",
    "name": "Rachel Summers",
    "aliases": [
      "Phoenix",
      "Marvel Girl",
      "Mother Askani",
      "Prestige",
      "Rachel Grey"
    ],
    "first_appearance_issue": "Uncanny X-Men #141 (1981)",
    "universe": "Earth-811 (Days of Future Past)",
    "teams": [
      "X-Men",
      "Excalibur",
      "Starjammers",
      "X-Factor"
    ],
    "description": "The daughter of Scott Summers and Jean Grey from the Days of Future Past timeline. Rachel is one of the most powerful telepaths and telekinetics in Marvel history, having wielded the full Phoenix Force. She is a time-displaced survivor of a dystopian future who found a home in the present-day X-Men."
  },
  {
    "slug": "kwannon",
    "name": "Kwannon",
    "aliases": [
      "Psylocke",
      "Revanche"
    ],
    "first_appearance_issue": "Uncanny X-Men #256 (1989)",
    "universe": "Earth-616",
    "teams": [
      "X-Men",
      "Hellions"
    ],
    "description": "A Japanese assassin whose body was swapped with Betsy Braddock's by the Hand and Spiral. After decades of confusion, Kwannon was restored to her own body and reclaimed the Psylocke name, wielding telekinetic weapons as a member of Zeb Wells's Hellions during the Krakoa era."
  },
  {
    "slug": "captain-britain",
    "name": "Brian Braddock",
    "aliases": [
      "Captain Britain",
      "Doyen of the Captain Britain Corps"
    ],
    "first_appearance_issue": "Captain Britain #1 (1976)",
    "universe": "Earth-616",
    "teams": [
      "Captain Britain Corps",
      "Excalibur",
      "Avengers",
      "Illuminati"
    ],
    "description": "Britain's premier superhero, empowered by Merlyn and Roma to be the champion of the Omniverse. Brian Braddock draws his power from confidence and the Amulet of Right. He leads the Captain Britain Corps, an army of multiversal Captain Britains, and is Betsy Braddock's twin brother."
  },
  {
    "slug": "meggan",
    "name": "Meggan Puceanu",
    "aliases": [
      "Meggan",
      "Gloriana"
    ],
    "first_appearance_issue": "Mighty World of Marvel #7 (1983)",
    "universe": "Earth-616",
    "teams": [
      "Excalibur",
      "Captain Britain Corps",
      "MI-13"
    ],
    "description": "A shapeshifting empath and wife of Captain Britain. Born a Romani mutant in the UK, Meggan can sense and manipulate the emotions and elemental forces around her. She was a founding member of Excalibur and is deeply connected to the magical ley lines of the British Isles."
  },
  {
    "slug": "pete-wisdom",
    "name": "Peter Wisdom",
    "aliases": [
      "Pete Wisdom"
    ],
    "first_appearance_issue": "Excalibur #86 (1995)",
    "universe": "Earth-616",
    "teams": [
      "Excalibur",
      "X-Force",
      "MI-13"
    ],
    "description": "A British mutant secret agent who can generate hot knives of thermal energy from his fingertips. Pete Wisdom is Marvel's answer to a cynical, chain-smoking spy who has served in MI-13 and various X-teams. Created by Warren Ellis, he brings a grounded espionage tone to mutant stories."
  },
  {
    "slug": "deadpool",
    "name": "Wade Wilson",
    "aliases": [
      "Deadpool",
      "The Merc with a Mouth",
      "Regenerating Degenerate"
    ],
    "first_appearance_issue": "New Mutants #98 (1991)",
    "universe": "Earth-616",
    "teams": [
      "X-Force",
      "Avengers",
      "Thunderbolts",
      "Mercs for Money"
    ],
    "description": "A disfigured mercenary with a regenerative healing factor and an irreverent, fourth-wall-breaking sense of humor. Initially a Rob Liefeld villain, Deadpool evolved into one of Marvel's most popular characters. His blend of comedy and tragedy, especially under Joe Kelly and Gerry Duggan, made him a cultural phenomenon."
  },
  {
    "slug": "domino",
    "name": "Neena Thurman",
    "aliases": [
      "Domino"
    ],
    "first_appearance_issue": "X-Force #8 (1992)",
    "universe": "Earth-616",
    "teams": [
      "X-Force",
      "Six Pack",
      "Posse"
    ],
    "description": "A mutant mercenary whose power is subconscious telekinetic probability manipulation, essentially luck manipulation. Domino is an expert marksman and combatant who has been a core member of X-Force. Her luck power subtly shifts events in her favor, making her practically unbeatable in combat."
  },
  {
    "slug": "multiple-man",
    "name": "James Arthur Madrox",
    "aliases": [
      "Multiple Man",
      "Jamie Madrox"
    ],
    "first_appearance_issue": "Giant-Size Fantastic Four #4 (1975)",
    "universe": "Earth-616",
    "teams": [
      "X-Factor Investigations",
      "X-Men",
      "X-Corps"
    ],
    "description": "A mutant who creates duplicates of himself upon physical impact, each duplicate capable of independent thought and experience. Jamie Madrox was the heart of Peter David's beloved X-Factor Investigations series, which reimagined him as a noir detective. His dupes have developed distinct personalities and even gone rogue."
  },
  {
    "slug": "hulkling",
    "name": "Teddy Altman",
    "aliases": [
      "Hulkling",
      "Dorrek VIII",
      "Emperor Hulkling",
      "King of Space"
    ],
    "first_appearance_issue": "Young Avengers #1 (2005)",
    "universe": "Earth-616",
    "teams": [
      "Young Avengers",
      "New Avengers",
      "Alliance"
    ],
    "description": "A Kree-Skrull hybrid and the prophesied unifier of both empires. Teddy Altman possesses shapeshifting abilities and super strength. His marriage to Wiccan in Empyre was a landmark moment for LGBTQ+ representation in comics. As Emperor of the Alliance, he united the Kree and Skrull empires."
  },
  {
    "slug": "wiccan",
    "name": "William Kaplan-Altman",
    "aliases": [
      "Wiccan",
      "Asgardian",
      "Demiurge",
      "Billy Kaplan"
    ],
    "first_appearance_issue": "Young Avengers #1 (2005)",
    "universe": "Earth-616",
    "teams": [
      "Young Avengers",
      "New Avengers",
      "Strikeforce"
    ],
    "description": "The reincarnated son of Scarlet Witch and Vision, a reality-warping mage prophesied to become the Demiurge, a cosmic entity who will rewrite the rules of magic. Wiccan's marriage to Hulkling was a milestone in comics representation. His chaos magic potential may rival his mother's."
  },
  {
    "slug": "speed",
    "name": "Thomas Shepherd",
    "aliases": [
      "Speed"
    ],
    "first_appearance_issue": "Young Avengers #10 (2006)",
    "universe": "Earth-616",
    "teams": [
      "Young Avengers"
    ],
    "description": "The reincarnated twin son of Scarlet Witch and Vision, possessing super speed analogous to his uncle Quicksilver. Tommy Shepherd is the brash, impulsive counterpart to his twin brother Wiccan. He was held in a juvenile detention facility where his powers were weaponized before the Young Avengers freed him."
  },
  {
    "slug": "patriot-eli",
    "name": "Elijah Bradley",
    "aliases": [
      "Patriot"
    ],
    "first_appearance_issue": "Young Avengers #1 (2005)",
    "universe": "Earth-616",
    "teams": [
      "Young Avengers"
    ],
    "description": "The grandson of Isaiah Bradley, the Black Captain America from the Truth: Red, White & Black storyline. Eli initially faked having super-soldier serum powers before receiving a blood transfusion from his grandfather. As Patriot, he was the original leader of the Young Avengers and heir to the Captain America legacy."
  },
  {
    "slug": "cloak",
    "name": "Tyrone Johnson",
    "aliases": [
      "Cloak"
    ],
    "first_appearance_issue": "Peter Parker, The Spectacular Spider-Man #64 (1982)",
    "universe": "Earth-616",
    "teams": [
      "Cloak and Dagger",
      "Dark X-Men",
      "New Warriors"
    ],
    "description": "A young man from Boston who gained the ability to access the Darkforce Dimension after being experimented on with synthetic drugs. Cloak can teleport through the Darkforce and engulf others in darkness. He is inseparable from his partner Dagger, and together they wage war on drug dealers and human traffickers."
  },
  {
    "slug": "dagger",
    "name": "Tandy Bowen",
    "aliases": [
      "Dagger"
    ],
    "first_appearance_issue": "Peter Parker, The Spectacular Spider-Man #64 (1982)",
    "universe": "Earth-616",
    "teams": [
      "Cloak and Dagger",
      "New Warriors"
    ],
    "description": "A young woman from a wealthy family who gained the ability to generate Lightforce daggers after the same experiment that created Cloak. Dagger's light complements Cloak's darkness, and she can heal others with her Lightforce. The two are bonded symbiotically and cannot be separated for long without suffering."
  },
  {
    "slug": "nova-rider",
    "name": "Richard Rider",
    "aliases": [
      "Nova",
      "Nova Prime"
    ],
    "first_appearance_issue": "Nova #1 (1976)",
    "universe": "Earth-616",
    "teams": [
      "Nova Corps",
      "New Warriors",
      "Secret Avengers",
      "Champions"
    ],
    "description": "A high school student from New York who was chosen by the dying Rhomann Dey to receive the Nova Force. Rich Rider became the last Nova during the Annihilation War and carried the entire Nova Force alone, making him one of Marvel's most powerful cosmic heroes. His sacrifice in the Cancerverse alongside Star-Lord is legendary."
  },
  {
    "slug": "nova-alexander",
    "name": "Sam Alexander",
    "aliases": [
      "Nova"
    ],
    "first_appearance_issue": "Marvel Point One #1 (2012)",
    "universe": "Earth-616",
    "teams": [
      "Nova Corps",
      "Champions",
      "New Warriors"
    ],
    "description": "A teenager from Carefree, Arizona who inherited a Black Nova helmet from his father. Sam Alexander became the newest Nova, wielding cosmic power while balancing superheroics with high school. He was a founding member of the Champions, Marvel's teen hero team, alongside Ms. Marvel and Miles Morales."
  },
  {
    "slug": "squirrel-girl",
    "name": "Doreen Green",
    "aliases": [
      "Squirrel Girl",
      "The Unbeatable Squirrel Girl"
    ],
    "first_appearance_issue": "Marvel Super-Heroes (1991) #8 (1992)",
    "universe": "Earth-616",
    "teams": [
      "Great Lakes Avengers",
      "New Avengers",
      "U.S.Avengers"
    ],
    "description": "A mutant with squirrel-like abilities and the power to communicate with squirrels. Doreen Green has famously defeated Doctor Doom, Thanos, and Galactus. Ryan North and Erica Henderson's The Unbeatable Squirrel Girl series cemented her as one of Marvel's most beloved all-ages characters."
  },
  {
    "slug": "moon-girl",
    "name": "Lunella Lafayette",
    "aliases": [
      "Moon Girl"
    ],
    "first_appearance_issue": "Moon Girl and Devil Dinosaur #1 (2016)",
    "universe": "Earth-616",
    "teams": [
      "FF (Future Foundation)"
    ],
    "description": "A nine-year-old Inhuman super-genius from the Lower East Side of Manhattan who is the smartest person in the Marvel Universe. Lunella shares a consciousness-swapping bond with Devil Dinosaur, a massive red T-Rex from an alternate prehistoric Earth. She represents Marvel's push toward younger, diverse heroes."
  },
  {
    "slug": "ironheart",
    "name": "Riri Williams",
    "aliases": [
      "Ironheart"
    ],
    "first_appearance_issue": "Invincible Iron Man (2015) #7 (2016)",
    "universe": "Earth-616",
    "teams": [
      "Champions",
      "Avengers"
    ],
    "description": "A fifteen-year-old genius from Chicago who reverse-engineered an Iron Man suit in her MIT dorm room. Riri Williams took up the Ironheart mantle with Tony Stark's blessing and later became a member of the Champions. Eve Ewing's Ironheart series explored her character depth beyond the armor."
  },
  {
    "slug": "wong",
    "name": "Wong",
    "aliases": [],
    "first_appearance_issue": "Strange Tales #110 (1963)",
    "universe": "Earth-616",
    "teams": [
      "Avengers allies",
      "Defenders allies"
    ],
    "description": "Doctor Strange's loyal friend, confidant, and the manager of his Sanctum Sanctorum. Wong is far more than a servant, being a skilled martial artist and practitioner of magic in his own right. Modern interpretations have elevated him to Strange's equal partner in the defense of Earth from mystical threats."
  },
  {
    "slug": "clea",
    "name": "Clea Strange",
    "aliases": [
      "Clea",
      "Sorcerer Supreme"
    ],
    "first_appearance_issue": "Strange Tales #126 (1964)",
    "universe": "Dark Dimension / Earth-616",
    "teams": [
      "Defenders",
      "Daughters of the Dark Dimension"
    ],
    "description": "The niece of Dormammu and wife of Doctor Strange. Clea is a powerful sorceress who rules the Dark Dimension and became Sorcerer Supreme after Stephen Strange's death during Blood Hunt. Her dual nature as both royalty of a hostile dimension and defender of Earth creates unique conflicts."
  },
  {
    "slug": "brother-voodoo",
    "name": "Jericho Drumm",
    "aliases": [
      "Brother Voodoo",
      "Doctor Voodoo",
      "Sorcerer Supreme"
    ],
    "first_appearance_issue": "Strange Tales #169 (1973)",
    "universe": "Earth-616",
    "teams": [
      "Avengers",
      "Uncanny Avengers"
    ],
    "description": "A Haitian houngan who merged with the spirit of his dead twin brother Daniel to become Brother Voodoo. Jericho briefly served as Sorcerer Supreme after Doctor Strange, wielding both voodoo magic and the Eye of Agamotto. He represents the intersection of Marvel's mystical and cultural diversity."
  },
  {
    "slug": "moonstone",
    "name": "Karla Sofen",
    "aliases": [
      "Moonstone",
      "Ms. Marvel (Dark Avengers)",
      "Meteorite"
    ],
    "first_appearance_issue": "Captain America #192 (1975)",
    "universe": "Earth-616",
    "teams": [
      "Thunderbolts",
      "Dark Avengers",
      "Masters of Evil"
    ],
    "description": "A psychologist turned supervillain who stole a Kree Lifestone that grants her energy manipulation, flight, and intangibility. Moonstone served as the fake Ms. Marvel on Osborn's Dark Avengers and has been a core member of the Thunderbolts. She is a master manipulator whose psychological expertise makes her uniquely dangerous."
  },
  {
    "slug": "songbird",
    "name": "Melissa Joan Gold",
    "aliases": [
      "Songbird",
      "Screaming Mimi",
      "Mimi Schwartz"
    ],
    "first_appearance_issue": "Marvel Two-in-One #54 (1979)",
    "universe": "Earth-616",
    "teams": [
      "Thunderbolts",
      "New Avengers"
    ],
    "description": "A former villain and professional wrestler who could generate sonic screams. As Songbird, she gained the ability to create solid sound constructs. Her redemption arc through the Thunderbolts is one of the most genuine villain-to-hero journeys in Marvel history, and she is often considered the heart of that team."
  },
  {
    "slug": "black-cat",
    "name": "Felicia Hardy",
    "aliases": [
      "Black Cat"
    ],
    "first_appearance_issue": "Amazing Spider-Man #194 (1979)",
    "universe": "Earth-616",
    "teams": [
      "Heroes for Hire",
      "A-Force"
    ],
    "description": "A skilled cat burglar and on-again, off-again love interest of Spider-Man. Felicia Hardy possesses bad luck powers and exceptional acrobatic and combative abilities. She walks the line between hero and thief, running a criminal empire while maintaining genuine feelings for Peter Parker."
  },
  {
    "slug": "tigra",
    "name": "Greer Grant Nelson",
    "aliases": [
      "Tigra",
      "The Cat"
    ],
    "first_appearance_issue": "The Cat #1 (1972)",
    "universe": "Earth-616",
    "teams": [
      "Avengers",
      "West Coast Avengers",
      "Lady Liberators"
    ],
    "description": "Originally the non-powered heroine The Cat, Greer Grant was transformed by Cat People magic into Tignetwork, gaining feline superhuman abilities and a tiger-striped appearance. Tigra is a longtime Avenger who has served on the West Coast team and struggled with balancing her human and feline natures."
  },
  {
    "slug": "mockingbird",
    "name": "Barbara Morse",
    "aliases": [
      "Mockingbird",
      "Bobbi Morse",
      "Huntress"
    ],
    "first_appearance_issue": "Astonishing Tales #6 (1971)",
    "universe": "Earth-616",
    "teams": [
      "Avengers",
      "West Coast Avengers",
      "S.H.I.E.L.D.",
      "New Agents of Atlas"
    ],
    "description": "A S.H.I.E.L.D. agent and biochemist who became the costumed hero Mockingbird, wielding her signature battle staves. Bobbi Morse was married to Hawkeye and co-led the West Coast Avengers. She was believed dead for years before being revealed as a Skrull captive during Secret Invasion."
  },
  {
    "slug": "spectrum",
    "name": "Monica Rambeau",
    "aliases": [
      "Spectrum",
      "Captain Marvel",
      "Photon",
      "Pulsar"
    ],
    "first_appearance_issue": "Amazing Spider-Man Annual #16 (1982)",
    "universe": "Earth-616",
    "teams": [
      "Avengers",
      "Nextwave",
      "Mighty Avengers",
      "Ultimates"
    ],
    "description": "A former New Orleans harbor patrol lieutenant who gained the ability to transform into any form of electromagnetic energy. Monica Rambeau served as leader of the Avengers and has held multiple codenames. She was a key member of Al Ewing's Ultimates and Mighty Avengers teams."
  },
  {
    "slug": "gorr",
    "name": "Gorr",
    "aliases": [
      "Gorr the God Butcher",
      "All-Black the All-Father"
    ],
    "first_appearance_issue": "Thor: God of Thunder #2 (2013)",
    "universe": "Earth-616",
    "teams": [],
    "description": "A mortal from an unnamed planet who was abandoned by his gods and swore vengeance on all deities. Wielding All-Black the Necrosword, the first symbiote, Gorr slaughtered gods across the universe. Jason Aaron's God Butcher saga established him as one of Thor's greatest foes and connected to the Knull/symbiote mythology."
  },
  {
    "slug": "knull",
    "name": "Knull",
    "aliases": [
      "King in Black",
      "God of the Symbiotes",
      "Lord of the Abyss"
    ],
    "first_appearance_issue": "Venom (2018) #3 (2018)",
    "universe": "Earth-616",
    "teams": [],
    "description": "The primordial god of darkness who created the symbiotes as weapons against the Celestials. Knull forged All-Black the Necrosword and ruled an empire of living darkness. He was the central antagonist of the King in Black event, where he engulfed Earth in symbiote darkness before being defeated by Eddie Brock."
  },
  {
    "slug": "the-maker",
    "name": "Reed Richards (Ultimate)",
    "aliases": [
      "The Maker",
      "Ultimate Reed Richards"
    ],
    "first_appearance_issue": "Ultimate Fantastic Four #1 (2004)",
    "universe": "Earth-1610",
    "teams": [
      "Dark Ultimates",
      "W.H.I.S.P.E.R.",
      "Council of Reeds"
    ],
    "description": "The Reed Richards of the Ultimate Universe who went insane and became one of Marvel's most terrifying villains. Unlike his Earth-616 counterpart, this Reed rejected humanity and evolved himself into a stretching, brain-expanding monster. After Secret Wars (2015), The Maker crossed into Earth-616 as a major threat."
  },
  {
    "slug": "captain-universe",
    "name": "Uni-Power",
    "aliases": [
      "Captain Universe",
      "The Enigma Force"
    ],
    "first_appearance_issue": "Micronauts #8 (1979)",
    "universe": "Earth-616",
    "teams": [],
    "description": "Not a single person but a cosmic force, the Uni-Power, that bonds with individuals in times of great need, granting them the power of Captain Universe. The Enigma Force has empowered Spider-Man, the Hulk, and many others. It is connected to the Microverse and represents the universe's immune system."
  },
  {
    "slug": "quasar-vaughn",
    "name": "Wendell Vaughn",
    "aliases": [
      "Quasar",
      "Protector of the Universe",
      "Marvel Man"
    ],
    "first_appearance_issue": "Captain America #217 (1978)",
    "universe": "Earth-616",
    "teams": [
      "Avengers",
      "Project Pegasus",
      "Annihilators",
      "S.T.A.R.S."
    ],
    "description": "The Protector of the Universe, wielding the Quantum Bands that channel cosmic energy into hard-light constructs. Wendell Vaughn was a S.H.I.E.L.D. agent deemed too lacking in killer instinct for fieldwork, which paradoxically made him the ideal candidate for the Quantum Bands. He was a central figure in cosmic Marvel events."
  },
  {
    "slug": "phyla-vell",
    "name": "Phyla-Vell",
    "aliases": [
      "Quasar",
      "Captain Marvel",
      "Martyr"
    ],
    "first_appearance_issue": "Captain Marvel (2002) #16 (2004)",
    "universe": "Earth-616",
    "teams": [
      "Guardians of the Galaxy",
      "Annihilators"
    ],
    "description": "The daughter of the original Captain Marvel (Mar-Vell), created during the Infinity War. Phyla-Vell has used the Quantum Bands as Quasar and the Oblivion Sword as Martyr. She was a key member of the DnA Guardians of the Galaxy and is in a relationship with Moondragon."
  },
  {
    "slug": "moondragon",
    "name": "Heather Douglas",
    "aliases": [
      "Moondragon",
      "Madame MacEvil"
    ],
    "first_appearance_issue": "Iron Man #54 (1973)",
    "universe": "Earth-616",
    "teams": [
      "Avengers",
      "Defenders",
      "Guardians of the Galaxy",
      "Infinity Watch"
    ],
    "description": "The daughter of the man whose body became Drax the Destroyer, raised on Titan by the monks of Shao-Lom. Moondragon is an immensely powerful telepath and martial artist. Her arrogance and power have led to both heroism and villainy, including once mind-controlling an entire planet."
  },
  {
    "slug": "mantis",
    "name": "Mantis",
    "aliases": [
      "Celestial Madonna",
      "Mandy Celestine",
      "Brandt"
    ],
    "first_appearance_issue": "Avengers #112 (1973)",
    "universe": "Earth-616",
    "teams": [
      "Avengers",
      "Guardians of the Galaxy",
      "Fantastic Four"
    ],
    "description": "The Celestial Madonna, prophesied to give birth to the Celestial Messiah. Mantis is a master martial artist with empathic powers who can communicate with plant life. Created by Steve Englehart, she has a complicated publishing history across multiple companies and was a member of both the Avengers and Guardians."
  },
  {
    "slug": "selene",
    "name": "Selene Gallio",
    "aliases": [
      "Selene",
      "Black Queen",
      "The Black Priestess"
    ],
    "first_appearance_issue": "New Mutants #9 (1983)",
    "universe": "Earth-616",
    "teams": [
      "Hellfire Club",
      "Externals"
    ],
    "description": "A 17,000-year-old psychic vampire and External who is one of the oldest mutants in existence. Selene is the Black Queen of the Hellfire Club and has attempted world domination via necromancy, most notably in the Necrosha event where she resurrected millions of dead mutants to fuel her ascension to godhood."
  },
  {
    "slug": "living-tribunal",
    "name": "The Living Tribunal",
    "aliases": [
      "Living Tribunal"
    ],
    "first_appearance_issue": "Strange Tales #157 (1967)",
    "universe": "Multiverse",
    "teams": [],
    "description": "A vastly powerful cosmic entity who serves as judge of the entire Marvel Multiverse. The Living Tribunal has three faces representing equity, revenge, and necessity. It can nullify the Infinity Gems and was killed by the Beyonders in Hickman's New Avengers, signaling the multiverse's impending collapse."
  },
  {
    "slug": "eternity",
    "name": "Eternity",
    "aliases": [
      "The Universe"
    ],
    "first_appearance_issue": "Strange Tales #138 (1965)",
    "universe": "Earth-616",
    "teams": [
      "Cosmic Entities"
    ],
    "description": "The abstract embodiment of the Marvel Universe itself, the sum total of all life and time in the 616 reality. Eternity typically appears as a humanoid silhouette filled with stars and galaxies. It rarely intervenes directly but has done so during the most catastrophic cosmic events."
  },
  {
    "slug": "death-entity",
    "name": "Death",
    "aliases": [
      "Mistress Death",
      "Lady Death"
    ],
    "first_appearance_issue": "Captain Marvel #26 (1973)",
    "universe": "Earth-616",
    "teams": [
      "Cosmic Entities"
    ],
    "description": "The abstract embodiment of mortality and death in the Marvel Universe. Death typically appears as a silent, robed woman. Thanos's obsessive love for Death is the driving motivation behind his quest for the Infinity Gauntlet and much of his characterization. She rarely speaks directly."
  },
  {
    "slug": "infinity-entity",
    "name": "Infinity",
    "aliases": [],
    "first_appearance_issue": "Quasar #24 (1991)",
    "universe": "Earth-616",
    "teams": [
      "Cosmic Entities"
    ],
    "description": "The abstract embodiment of space and the counterpart to Eternity, who embodies time. Infinity is less frequently depicted than Eternity but is equally fundamental to the Marvel cosmology. Together, Eternity and Infinity represent the complete fabric of the 616 universe."
  },
  {
    "slug": "oblivion",
    "name": "Oblivion",
    "aliases": [],
    "first_appearance_issue": "Iceman #1 (1984)",
    "universe": "Earth-616",
    "teams": [
      "Cosmic Entities"
    ],
    "description": "The abstract embodiment of non-existence and the void, the counterpart to Death. Oblivion represents the entropy and nothingness that preceded and will follow the universe. It is the patron of cosmic threats like Deathurge and Maelstrom and is among the most fundamental cosmic entities."
  },
  {
    "slug": "franklin-richards",
    "name": "Franklin Richards",
    "aliases": [
      "Powerhouse",
      "Psi-Lord",
      "Franklin Benjamin Richards"
    ],
    "first_appearance_issue": "Fantastic Four Annual #6 (1968)",
    "universe": "Earth-616",
    "teams": [
      "Fantastic Four",
      "Future Foundation",
      "Power Pack"
    ],
    "description": "The son of Reed Richards and Sue Storm, born a mutant with reality-warping powers of cosmic magnitude. Franklin has created pocket universes and is considered an Omega-level mutant. In Hickman's Secret Wars, he and his father rebuilt the multiverse. Whether he remains a mutant after recent stories is debated."
  },
  {
    "slug": "valeria-richards",
    "name": "Valeria Richards",
    "aliases": [
      "Brainstorm",
      "Val"
    ],
    "first_appearance_issue": "Fantastic Four (1998) #54 (2002)",
    "universe": "Earth-616",
    "teams": [
      "Fantastic Four",
      "Future Foundation"
    ],
    "description": "The daughter of Reed Richards and Sue Storm, a child prodigy whose intellect rivals her father's and possibly Doctor Doom's. Valeria was delivered by Doctor Doom, creating a unique bond between them. She leads the Future Foundation's younger members and is one of Marvel's smartest characters."
  },
  {
    "slug": "joe-fixit",
    "name": "Joe Fixit",
    "aliases": [
      "Grey Hulk",
      "Mr. Fixit"
    ],
    "first_appearance_issue": "Incredible Hulk #324 (1986)",
    "universe": "Earth-616",
    "teams": [],
    "description": "A distinct personality within Bruce Banner's psyche who manifests as a grey-skinned, cunning Hulk. Joe Fixit is weaker than the Savage Hulk but far more intelligent and streetwise, operating as a Las Vegas enforcer. Peter David's run explored the multiple Hulk personalities extensively, establishing Fixit as a fan-favorite persona."
  },
  {
    "slug": "devil-hulk",
    "name": "Devil Hulk",
    "aliases": [],
    "first_appearance_issue": "Incredible Hulk (2000) #13 (2000)",
    "universe": "Earth-616",
    "teams": [],
    "description": "A persona of the Hulk reimagined in Al Ewing's Immortal Hulk as a reptilian, cunning protector personality connected to the One Below All, a gamma-powered cosmic horror entity. Devil Hulk claimed to exist to protect Bruce Banner, but his true nature and connection to the Green Door gamma afterlife was more complex and terrifying."
  },
  {
    "slug": "agatha-harkness",
    "name": "Agatha Harkness",
    "aliases": [],
    "first_appearance_issue": "Fantastic Four #94 (1970)",
    "universe": "Earth-616",
    "teams": [
      "Salem's Seven (former leader)",
      "New Salem"
    ],
    "description": "An ancient and powerful witch who served as governess to Franklin Richards and magical mentor to Scarlet Witch. Agatha Harkness is one of Earth's most powerful human sorcerers, having survived the Salem Witch Trials. She has died and returned multiple times, most recently playing a major role in Scarlet Witch's solo series."
  },
  {
    "slug": "wonder-man",
    "name": "Simon Williams",
    "aliases": [
      "Wonder Man"
    ],
    "first_appearance_issue": "Avengers #9 (1964)",
    "universe": "Earth-616",
    "teams": [
      "Avengers",
      "West Coast Avengers",
      "Revengers",
      "Lethal Legion"
    ],
    "description": "An industrialist empowered by Baron Zemo with ionic energy, making him one of the strongest Avengers. Wonder Man's brain patterns were used to create the Vision's personality, creating a complex bond between them. He has died and resurrected multiple times and had a Hollywood career between heroic stints."
  },
  {
    "slug": "wasp-nadia",
    "name": "Nadia Van Dyne",
    "aliases": [
      "Wasp",
      "Nadia Pym"
    ],
    "first_appearance_issue": "Free Comic Book Day 2016: Civil War II",
    "universe": "Earth-616",
    "teams": [
      "Avengers",
      "Champions",
      "G.I.R.L."
    ],
    "description": "The daughter of Hank Pym and his first wife Maria Trovaya, raised in the Red Room. Nadia escaped and took up the Wasp identity, founding G.I.R.L. (Genius In action Research Labs) for young women scientists. She brings infectious optimism and Pym-particle size-changing abilities to the Marvel Universe."
  },
  {
    "slug": "white-tiger-ava",
    "name": "Ava Ayala",
    "aliases": [
      "White Tiger"
    ],
    "first_appearance_issue": "Avengers Academy #20 (2011)",
    "universe": "Earth-616",
    "teams": [
      "New Avengers",
      "Mighty Avengers",
      "Avengers Academy"
    ],
    "description": "The latest wielder of the White Tiger Amulet, which grants her superhuman physical abilities and martial arts mastery channeled from the Tiger God. Ava is the sister of the original White Tiger, Hector Ayala, continuing a legacy of Latinx heroism in the Marvel Universe."
  },
  {
    "slug": "amadeus-cho",
    "name": "Amadeus Cho",
    "aliases": [
      "Brawn",
      "Totally Awesome Hulk",
      "Prince of Power",
      "Mastermind Excello"
    ],
    "first_appearance_issue": "Amazing Fantasy (2004) #15 (2006)",
    "universe": "Earth-616",
    "teams": [
      "Champions",
      "Agents of Atlas",
      "Mighty Avengers"
    ],
    "description": "A Korean American teenager ranked as one of the top ten smartest people on Earth. Amadeus absorbed Bruce Banner's gamma radiation to become the Totally Awesome Hulk, later taking the name Brawn. He is a founding member of the Champions and an ally of Hercules in the God Squad."
  },
  {
    "slug": "nebula",
    "name": "Nebula",
    "aliases": [],
    "first_appearance_issue": "Avengers #257 (1985)",
    "universe": "Earth-616",
    "teams": [
      "Guardians of the Galaxy",
      "Graces"
    ],
    "description": "A space pirate who claimed to be the granddaughter of Thanos, which Thanos furiously denied. Nebula briefly wielded the Infinity Gauntlet during the Infinity Gauntlet event. Originally a villain, she has evolved into a complex antihero associated with the Guardians of the Galaxy."
  },
  {
    "slug": "ronan",
    "name": "Ronan",
    "aliases": [
      "Ronan the Accuser"
    ],
    "first_appearance_issue": "Fantastic Four #65 (1967)",
    "universe": "Earth-616",
    "teams": [
      "Kree Empire",
      "Annihilators"
    ],
    "description": "The Supreme Accuser of the Kree Empire, wielding the devastating Universal Weapon hammer. Originally a villain who fought the Fantastic Four, Ronan became a more nuanced figure during the Annihilation era, defending the Kree against the Annihilation Wave and marrying Crystal of the Inhumans."
  },
  {
    "slug": "super-skrull",
    "name": "Kl'rt",
    "aliases": [
      "Super-Skrull"
    ],
    "first_appearance_issue": "Fantastic Four #18 (1963)",
    "universe": "Earth-616",
    "teams": [
      "Skrull Empire"
    ],
    "description": "A Skrull warrior engineered to possess the combined powers of all four members of the Fantastic Four. Kl'rt was originally a straightforward villain but became an antihero during the Annihilation event, defending the Skrull empire. His sacrifice to destroy Harvester of Sorrow was a defining moment of that era."
  },
  {
    "slug": "gladiator-kallark",
    "name": "Kallark",
    "aliases": [
      "Gladiator",
      "Majestor of the Shi'ar"
    ],
    "first_appearance_issue": "Uncanny X-Men #107 (1977)",
    "universe": "Earth-616",
    "teams": [
      "Shi'ar Imperial Guard",
      "Annihilators"
    ],
    "description": "The Praetor of the Shi'ar Imperial Guard, modeled after Superman in an intentional homage. Gladiator's strength and powers are fueled by his confidence. He eventually became Majestor (emperor) of the Shi'ar Empire, making him one of the most powerful political and physical figures in cosmic Marvel."
  },
  {
    "slug": "lilandra",
    "name": "Lilandra Neramani",
    "aliases": [
      "Majestrix of the Shi'ar"
    ],
    "first_appearance_issue": "Uncanny X-Men #97 (1976)",
    "universe": "Earth-616",
    "teams": [
      "Shi'ar Empire"
    ],
    "description": "The Majestrix of the Shi'ar Empire and longtime love interest of Charles Xavier. Their psychic connection across galaxies is one of the most enduring relationships in X-Men lore. Lilandra was assassinated during War of Kings, a devastating moment for both Xavier and the Shi'ar Empire."
  },
  {
    "slug": "vulcan",
    "name": "Gabriel Summers",
    "aliases": [
      "Vulcan",
      "Kid Vulcan"
    ],
    "first_appearance_issue": "X-Men: Deadly Genesis #1 (2006)",
    "universe": "Earth-616",
    "teams": [
      "X-Men (briefly)",
      "Shi'ar Empire"
    ],
    "description": "The third Summers brother, an Omega-level mutant who can manipulate all forms of energy. Gabriel was a secret member of an X-Men team sent to rescue the original team from Krakoa. He conquered the Shi'ar Empire and was the central antagonist of the War of Kings cosmic event."
  },
  {
    "slug": "havok",
    "name": "Alexander Summers",
    "aliases": [
      "Havok"
    ],
    "first_appearance_issue": "Uncanny X-Men #54 (1969)",
    "universe": "Earth-616",
    "teams": [
      "X-Men",
      "X-Factor",
      "Starjammers",
      "Avengers",
      "Uncanny Avengers"
    ],
    "description": "Scott Summers's younger brother, who absorbs cosmic radiation and channels it as concentric plasma blasts. Havok has led X-Factor, served on the Avengers, and struggled to emerge from his brother's shadow. He led the Uncanny Avengers unity squad combining mutants and Avengers."
  },
  {
    "slug": "polaris",
    "name": "Lorna Dane",
    "aliases": [
      "Polaris",
      "Pestilence",
      "Magnetrix"
    ],
    "first_appearance_issue": "Uncanny X-Men #49 (1968)",
    "universe": "Earth-616",
    "teams": [
      "X-Men",
      "X-Factor",
      "Starjammers",
      "Serval Industries"
    ],
    "description": "The daughter of Magneto with electromagnetic powers similar to her father's. Polaris has struggled with mental health issues and has been manipulated by villains throughout her history. Her on-again, off-again relationship with Havok is one of the X-Men's longest-running romances."
  },
  {
    "slug": "legion",
    "name": "David Haller",
    "aliases": [
      "Legion"
    ],
    "first_appearance_issue": "New Mutants #25 (1985)",
    "universe": "Earth-616",
    "teams": [
      "X-Men allies"
    ],
    "description": "The son of Charles Xavier, an Omega-level mutant with dissociative identity disorder where each personality controls a different superpower. Legion is potentially the most powerful mutant alive but is limited by his fractured psyche. Si Spurrier's X-Men Legacy series is considered his definitive portrayal."
  },
  {
    "slug": "exodus",
    "name": "Bennet du Paris",
    "aliases": [
      "Exodus"
    ],
    "first_appearance_issue": "X-Factor #92 (1993)",
    "universe": "Earth-616",
    "teams": [
      "Acolytes",
      "X-Men",
      "Quiet Council of Krakoa"
    ],
    "description": "A medieval Crusader empowered by Apocalypse into an Omega-level telekinetic and telepath. Exodus is a zealous follower of Magneto who became one of the most powerful mutants in existence. He served on the Quiet Council of Krakoa, representing the traditionalist mutant faction."
  },
  {
    "slug": "destiny",
    "name": "Irene Adler",
    "aliases": [
      "Destiny"
    ],
    "first_appearance_issue": "Uncanny X-Men #141 (1981)",
    "universe": "Earth-616",
    "teams": [
      "Brotherhood of Mutants",
      "Freedom Force",
      "Quiet Council of Krakoa"
    ],
    "description": "A blind precognitive mutant who can see the future with extraordinary accuracy. Destiny is the wife of Mystique, and their relationship is one of the longest-running in X-Men history. Her diaries predicting future events are a major plot device, and her resurrection on Krakoa was a pivotal moment in the Inferno storyline."
  },
  {
    "slug": "omega-red",
    "name": "Arkady Rossovich",
    "aliases": [
      "Omega Red"
    ],
    "first_appearance_issue": "X-Men (1991) #4 (1992)",
    "universe": "Earth-616",
    "teams": [
      "KGB",
      "Quiet Council of Krakoa"
    ],
    "description": "A Russian mutant super-soldier with carbonadium tentacles and a death factor that drains life force from those around him. Omega Red is a persistent Wolverine villain and Cold War-era threat. He served on Krakoa's Quiet Council as part of the villain contingent, an uneasy alliance at best."
  },
  {
    "slug": "sage-mutant",
    "name": "Tessa",
    "aliases": [
      "Sage",
      "Lady Tessa"
    ],
    "first_appearance_issue": "Uncanny X-Men #132 (1980)",
    "universe": "Earth-616",
    "teams": [
      "X-Men",
      "Hellfire Club",
      "Excalibur",
      "X-Treme X-Men",
      "S.W.O.R.D."
    ],
    "description": "A mutant with a computer-like mind capable of perfect recall and data processing. Sage was Xavier's mole inside the Hellfire Club for years before being revealed as an X-Man. She can also jump-start latent mutant genes in others, making her a uniquely valuable asset to the mutant community."
  },
  {
    "slug": "abigail-brand",
    "name": "Abigail Brand",
    "aliases": [
      "Commander Brand"
    ],
    "first_appearance_issue": "Astonishing X-Men (2004) #3 (2004)",
    "universe": "Earth-616",
    "teams": [
      "S.W.O.R.D.",
      "Alpha Flight"
    ],
    "description": "The half-alien commander of S.W.O.R.D. (Sentient World Observation and Response Department), Earth's extraterrestrial intelligence agency. Abigail Brand is a tough, pragmatic leader who operates in the gray areas of intergalactic diplomacy. She played major roles in Secret Invasion, the Krakoa era, and cosmic security."
  },
  {
    "slug": "corsair",
    "name": "Christopher Summers",
    "aliases": [
      "Corsair"
    ],
    "first_appearance_issue": "Uncanny X-Men #104 (1977)",
    "universe": "Earth-616",
    "teams": [
      "Starjammers"
    ],
    "description": "The father of Scott, Alex, and Gabriel Summers, who was abducted by the Shi'ar and became the leader of the Starjammers, a band of interstellar pirates and freedom fighters. Corsair's kidnapping and presumed death shaped his sons' lives profoundly. He is a swashbuckling adventurer in the mold of classic space opera heroes."
  },
  {
    "slug": "darwin-mutant",
    "name": "Armando Munoz",
    "aliases": [
      "Darwin"
    ],
    "first_appearance_issue": "X-Men: Deadly Genesis #2 (2006)",
    "universe": "Earth-616",
    "teams": [
      "X-Men",
      "X-Factor"
    ],
    "description": "A mutant with reactive evolution, meaning his body automatically adapts to survive any threat. Darwin's power has made him virtually unkillable, once even evolving the ability to become a god of death to survive Hela's touch. He was a member of the secret X-Men team revealed in Deadly Genesis."
  },
  {
    "slug": "pixie",
    "name": "Megan Gwynn",
    "aliases": [
      "Pixie"
    ],
    "first_appearance_issue": "New X-Men: Academy X #5 (2005)",
    "universe": "Earth-616",
    "teams": [
      "X-Men",
      "New X-Men"
    ],
    "description": "A Welsh mutant with rainbow butterfly wings, hallucinogenic pixie dust, and a fragment of the Soulsword called the Souldagger. Pixie can teleport via magical spells taught to her by Doctor Strange. She is one of the more prominent younger X-Men introduced in the 2000s."
  },
  {
    "slug": "armor-hisako",
    "name": "Hisako Ichiki",
    "aliases": [
      "Armor"
    ],
    "first_appearance_issue": "Astonishing X-Men (2004) #4 (2004)",
    "universe": "Earth-616",
    "teams": [
      "X-Men"
    ],
    "description": "A Japanese mutant who can generate psionic body armor of immense durability and strength, powered by the memory of her ancestors. Armor was introduced in Joss Whedon's Astonishing X-Men run and has since become a regular member of the X-Men, serving as Wolverine's protege."
  },
  {
    "slug": "manifold",
    "name": "Eden Fesi",
    "aliases": [
      "Manifold"
    ],
    "first_appearance_issue": "Secret Warriors #4 (2009)",
    "universe": "Earth-616",
    "teams": [
      "Avengers",
      "Secret Warriors",
      "S.W.O.R.D."
    ],
    "description": "An Aboriginal Australian mutant with the ability to fold space, creating teleportation gateways across any distance. Manifold was recruited by Nick Fury's Secret Warriors and later became a key member of Hickman's Avengers. His connection to the Dreamtime gives his powers a spiritual dimension."
  },
  {
    "slug": "hyperion",
    "name": "Marcus Milton",
    "aliases": [
      "Hyperion"
    ],
    "first_appearance_issue": "Avengers (2012) #1 (2012)",
    "universe": "Earth-13034",
    "teams": [
      "Avengers",
      "Squadron Supreme"
    ],
    "description": "A Superman analogue and the sole survivor of a destroyed universe who joined Hickman's Avengers. Multiple versions of Hyperion exist across the multiverse as members of various Squadron Supreme teams. The Hickman version formed a close friendship with Thor and played a crucial role in the incursion crisis."
  },
  {
    "slug": "starbrand",
    "name": "Kevin Connor",
    "aliases": [
      "Starbrand"
    ],
    "first_appearance_issue": "Avengers (2012) #1 (2012)",
    "universe": "Earth-616",
    "teams": [
      "Avengers"
    ],
    "description": "A college student who received the Starbrand, a cosmic power that designates its wielder as a planet's defense system. In Hickman's Avengers, Kevin was one of the new cosmic-powered beings recruited to face universe-level threats. The Starbrand concept originated in Marvel's New Universe line."
  },
  {
    "slug": "smasher-izzy",
    "name": "Isabel Kane",
    "aliases": [
      "Smasher"
    ],
    "first_appearance_issue": "Avengers (2012) #1 (2012)",
    "universe": "Earth-616",
    "teams": [
      "Avengers",
      "Shi'ar Imperial Guard"
    ],
    "description": "A human woman from Iowa who became the first Earthling admitted into the Shi'ar Imperial Guard as Smasher. She wears exospex that grant her superhuman abilities and served on Hickman's expanded Avengers roster. Her relationship with Cannonball during this era was a charming subplot."
  },
  {
    "slug": "shuri",
    "name": "Shuri",
    "aliases": [
      "Black Panther",
      "Griot"
    ],
    "first_appearance_issue": "Black Panther (2005) #2 (2005)",
    "universe": "Earth-616",
    "teams": [
      "Wakanda",
      "Avengers"
    ],
    "description": "T'Challa's sister and a genius inventor who briefly served as the Black Panther and Queen of Wakanda. Shuri combines scientific brilliance with spiritual connection to the Panther God. She has been one of the most important figures in modern Wakandan stories and a technological innovator rivaling Tony Stark."
  },
  {
    "slug": "okoye",
    "name": "Okoye",
    "aliases": [],
    "first_appearance_issue": "Black Panther (1998) #1 (1998)",
    "universe": "Earth-616",
    "teams": [
      "Dora Milaje",
      "Agents of Wakanda"
    ],
    "description": "The general of the Dora Milaje, Wakanda's all-female royal guard. Okoye is one of the most skilled fighters in the Marvel Universe and is fiercely loyal to the throne of Wakanda. She has led the Agents of Wakanda, an international team supporting the Avengers during Jason Aaron's run."
  },
  {
    "slug": "white-wolf",
    "name": "Hunter",
    "aliases": [
      "White Wolf"
    ],
    "first_appearance_issue": "Black Panther (1998) #4 (1998)",
    "universe": "Earth-616",
    "teams": [
      "Hatut Zeraze",
      "Wakandan Secret Police"
    ],
    "description": "A white orphan adopted by T'Chaka and raised as T'Challa's older brother in Wakanda. Hunter became the leader of the Hatut Zeraze, Wakanda's secret police, operating with ruthless efficiency. His complex relationship with T'Challa reflects themes of belonging, loyalty, and the darker side of nationalism."
  },
  {
    "slug": "echo",
    "name": "Maya Lopez",
    "aliases": [
      "Echo",
      "Ronin",
      "Phoenix"
    ],
    "first_appearance_issue": "Daredevil (1998) #9 (1999)",
    "universe": "Earth-616",
    "teams": [
      "Avengers",
      "New Avengers"
    ],
    "description": "A deaf Native American martial artist with photographic reflexes similar to Taskmaster's. Maya Lopez was raised by Kingpin and initially set against Daredevil before learning the truth. She was the first Ronin before Hawkeye and became the host of the Phoenix Force in the Avengers."
  },
  {
    "slug": "white-fox",
    "name": "Ami Han",
    "aliases": [
      "White Fox"
    ],
    "first_appearance_issue": "Amazing Spider-Man (2014) #1 (2014)",
    "universe": "Earth-616",
    "teams": [
      "Agents of Atlas",
      "Tiger Division"
    ],
    "description": "A Korean superhero who is the last of the kumiho, nine-tailed fox spirits. Ami Han is an agent of the National Intelligence Service of South Korea and a member of the Agents of Atlas. She represents Marvel's expansion into Korean mythology and characters."
  },
  {
    "slug": "wave",
    "name": "Pearl Pangan",
    "aliases": [
      "Wave"
    ],
    "first_appearance_issue": "War of the Realms: New Agents of Atlas #1 (2019)",
    "universe": "Earth-616",
    "teams": [
      "Agents of Atlas"
    ],
    "description": "A Filipino superhero with hydrokinetic powers who can control and transform into water. Wave joined the Agents of Atlas and is one of Marvel's Filipino representation characters. Her powers connect to the seas surrounding the Philippines and she draws strength from her cultural heritage."
  },
  {
    "slug": "sunfire",
    "name": "Shiro Yoshida",
    "aliases": [
      "Sunfire"
    ],
    "first_appearance_issue": "X-Men #64 (1970)",
    "universe": "Earth-616",
    "teams": [
      "X-Men",
      "Big Hero Six",
      "Uncanny Avengers",
      "Marauders"
    ],
    "description": "A Japanese mutant who generates superheated plasma and can fly. Sunfire is Japan's premier superhero but has a contentious relationship with the X-Men, joining and quitting multiple times. He was briefly one of Apocalypse's Horsemen and later served on the Uncanny Avengers and Krakoan Marauders."
  },
  {
    "slug": "northstar",
    "name": "Jean-Paul Beaubier",
    "aliases": [
      "Northstar"
    ],
    "first_appearance_issue": "Uncanny X-Men #120 (1979)",
    "universe": "Earth-616",
    "teams": [
      "Alpha Flight",
      "X-Men"
    ],
    "description": "A Canadian mutant with superhuman speed, flight, and the ability to generate blinding light with his twin sister Aurora. Northstar was one of the first openly gay superheroes in mainstream comics, and his marriage to Kyle Jinadu in Astonishing X-Men #51 was a landmark event in comics history."
  },
  {
    "slug": "aurora",
    "name": "Jeanne-Marie Beaubier",
    "aliases": [
      "Aurora"
    ],
    "first_appearance_issue": "Uncanny X-Men #120 (1979)",
    "universe": "Earth-616",
    "teams": [
      "Alpha Flight",
      "X-Men"
    ],
    "description": "Northstar's twin sister, a Canadian mutant with identical speed and light powers. Aurora has dissociative identity disorder, with her Jeanne-Marie personality being reserved and devout while her Aurora personality is uninhibited. Her mental health struggles have been a long-running element of her character."
  },
  {
    "slug": "sasquatch",
    "name": "Walter Langkowski",
    "aliases": [
      "Sasquatch",
      "Wanda Langkowski"
    ],
    "first_appearance_issue": "Uncanny X-Men #120 (1979)",
    "universe": "Earth-616",
    "teams": [
      "Alpha Flight",
      "Gamma Flight"
    ],
    "description": "A physicist and former football player who used gamma radiation to transform into the massive, orange-furred Sasquatch. Walter Langkowski is a founding member of Alpha Flight, Canada's premier superhero team. His transformation actually channeled the Great Beast Tanaraq rather than pure gamma power."
  },
  {
    "slug": "puck",
    "name": "Eugene Milton Judd",
    "aliases": [
      "Puck"
    ],
    "first_appearance_issue": "Alpha Flight #1 (1983)",
    "universe": "Earth-616",
    "teams": [
      "Alpha Flight",
      "X-Force"
    ],
    "description": "A compact, acrobatic Canadian adventurer and member of Alpha Flight. Despite his small stature, Puck is incredibly tough, agile, and experienced, having lived for over a century due to mystical means. He is one of Alpha Flight's most resilient and good-humored members."
  },
  {
    "slug": "guardian-hudson",
    "name": "James MacDonald Hudson",
    "aliases": [
      "Guardian",
      "Vindicator",
      "Weapon Alpha"
    ],
    "first_appearance_issue": "Uncanny X-Men #109 (1978)",
    "universe": "Earth-616",
    "teams": [
      "Alpha Flight"
    ],
    "description": "The leader and founder of Alpha Flight, Canada's government-sponsored superhero team. Guardian wears a battlesuit that grants him flight, force fields, and energy blasts based on Earth's electromagnetic field. He is the Canadian equivalent of Captain America, embodying national heroism."
  },
  {
    "slug": "quake",
    "name": "Daisy Johnson",
    "aliases": [
      "Quake"
    ],
    "first_appearance_issue": "Secret War #2 (2004)",
    "universe": "Earth-616",
    "teams": [
      "S.H.I.E.L.D.",
      "Secret Warriors",
      "Avengers"
    ],
    "description": "The daughter of Mister Hyde with the superhuman ability to generate seismic vibrations. Daisy Johnson was recruited by Nick Fury as a teenager and eventually became Director of S.H.I.E.L.D. She led the Secret Warriors team in Hickman's series and is one of Marvel's most capable young leaders."
  },
  {
    "slug": "yo-yo-rodriguez",
    "name": "Yo-Yo Rodriguez",
    "aliases": [
      "Slingshot"
    ],
    "first_appearance_issue": "Mighty Avengers #13 (2008)",
    "universe": "Earth-616",
    "teams": [
      "Secret Warriors"
    ],
    "description": "An Inhuman with superhuman speed who always snaps back to her starting point, like a yo-yo. She was a core member of Nick Fury's Secret Warriors team during the Secret Invasion era. Yo-Yo lost both her arms in battle but received prosthetics and continued fighting."
  },
  {
    "slug": "hellstrom",
    "name": "Daimon Hellstrom",
    "aliases": [
      "Hellstorm",
      "Son of Satan"
    ],
    "first_appearance_issue": "Ghost Rider #1 (1973)",
    "universe": "Earth-616",
    "teams": [
      "Defenders",
      "Midnight Sons"
    ],
    "description": "The son of a demon lord and a human woman, a powerful occultist and exorcist who wields a trident of Netheranium. Daimon Hellstrom walks the line between his demonic heritage and his desire to protect humanity. He has been both a Defender and a Midnight Son, serving as Marvel's resident demonologist."
  },
  {
    "slug": "elixir",
    "name": "Joshua Foley",
    "aliases": [
      "Elixir"
    ],
    "first_appearance_issue": "New Mutants (2003) #5 (2003)",
    "universe": "Earth-616",
    "teams": [
      "New X-Men",
      "X-Force",
      "The Five"
    ],
    "description": "An Omega-level mutant biokinetic who can manipulate biological matter at will, healing any wound or disease, or killing with a touch. Elixir is one of The Five, the mutant circuit responsible for resurrection on Krakoa. His golden skin turns black when he uses his death touch."
  },
  {
    "slug": "tempus",
    "name": "Eva Bell",
    "aliases": [
      "Tempus"
    ],
    "first_appearance_issue": "All-New X-Men #1 (2013)",
    "universe": "Earth-616",
    "teams": [
      "X-Men",
      "The Five"
    ],
    "description": "An Australian mutant who can create time-manipulation bubbles that freeze, slow, or accelerate time within their boundaries. Tempus is one of The Five on Krakoa, essential to the resurrection protocol. Bendis's Uncanny X-Men explored her accidentally traveling through time and living entire alternate lives."
  },
  {
    "slug": "proteus",
    "name": "Kevin MacTaggert",
    "aliases": [
      "Proteus",
      "Mutant X"
    ],
    "first_appearance_issue": "Uncanny X-Men #125 (1979)",
    "universe": "Earth-616",
    "teams": [
      "The Five"
    ],
    "description": "The reality-warping son of Moira MacTaggert, an Omega-level mutant who burns through physical host bodies. Proteus was one of the X-Men's most terrifying threats in the Claremont era. On Krakoa, he was stabilized as one of The Five, using his reality-warping powers to create husk bodies for resurrection."
  },
  {
    "slug": "goldballs",
    "name": "Fabio Medina",
    "aliases": [
      "Goldballs",
      "Egg"
    ],
    "first_appearance_issue": "Uncanny X-Men (2013) #1 (2013)",
    "universe": "Earth-616",
    "teams": [
      "X-Men",
      "The Five"
    ],
    "description": "A young mutant whose power was initially the comedic ability to produce golden spheres. On Krakoa, his power was recontextualized as producing non-viable eggs essential to the mutant resurrection process, making him one of The Five. His transformation from joke character to essential figure was a Hickman masterstroke."
  },
  {
    "slug": "cypher",
    "name": "Douglas Ramsey",
    "aliases": [
      "Cypher"
    ],
    "first_appearance_issue": "New Mutants #13 (1984)",
    "universe": "Earth-616",
    "teams": [
      "New Mutants",
      "X-Force",
      "X-Men"
    ],
    "description": "A mutant with the power to intuitively understand any language, including body language, computer code, and alien tongues. Once considered the most useless X-Man, Cypher became indispensable on Krakoa, serving as the interface between mutantkind and the living island itself. He is bonded with the techno-organic alien Warlock."
  },
  {
    "slug": "warlock-technarch",
    "name": "Warlock",
    "aliases": [
      "Warlock of the Technarchy",
      "Douglock"
    ],
    "first_appearance_issue": "New Mutants #18 (1984)",
    "universe": "Earth-616",
    "teams": [
      "New Mutants",
      "X-Factor"
    ],
    "description": "A member of the alien Technarchy who rejected his race's violent nature. Warlock is a shapeshifting techno-organic being with a childlike personality and deep friendship with Cypher. The two have been inseparable across decades of stories, and Warlock's unique nature made him a key part of Krakoan technology."
  },
  {
    "slug": "carol-danvers",
    "name": "Carol Danvers",
    "aliases": [
      "Captain Marvel",
      "Ms. Marvel",
      "Binary",
      "Warbird"
    ],
    "first_appearance_issue": "Marvel Super-Heroes #13 (1968)",
    "universe": "Earth-616",
    "teams": [
      "Avengers",
      "A-Force",
      "Ultimates",
      "Starjammers",
      "Alpha Flight Space Station"
    ],
    "description": "A former Air Force pilot who gained cosmic powers from a Kree Psyche-Magnitron explosion, Carol Danvers has evolved from Ms. Marvel to Binary to Warbird to Captain Marvel, becoming one of the most powerful heroes in the Marvel Universe. Under Kelly Sue DeConnick's landmark run, Carol fully embraced the Captain Marvel mantle and became the leader of the Avengers. She has served as commander of Alpha Flight Space Station and Earth's primary cosmic defender."
  },
  {
    "slug": "bucky-barnes",
    "name": "James Buchanan Barnes",
    "aliases": [
      "Bucky",
      "Winter Soldier",
      "Captain America"
    ],
    "first_appearance_issue": "Captain America Comics #1 (1941)",
    "universe": "Earth-616",
    "teams": [
      "Invaders",
      "Avengers",
      "Thunderbolts"
    ],
    "description": "Captain America's World War II sidekick, long believed dead after a plane explosion over the English Channel. Ed Brubaker's landmark Captain America run revealed Bucky survived and was brainwashed by the Soviets into becoming the Winter Soldier, a legendary assassin. After Steve Rogers' assassination following Civil War, Bucky took up the Captain America shield. His resurrection broke one of comics' most sacred rules — only Bucky, Jason Todd, and Uncle Ben stay dead."
  },
  {
    "slug": "sam-wilson",
    "name": "Sam Wilson",
    "aliases": [
      "Falcon",
      "Captain America"
    ],
    "first_appearance_issue": "Captain America #117 (1969)",
    "universe": "Earth-616",
    "teams": [
      "Avengers",
      "S.H.I.E.L.D.",
      "Heroes for Hire"
    ],
    "description": "The first African-American superhero in mainstream comics. Sam Wilson uses a winged flight harness and has a telepathic link with his falcon Redwing. A longtime partner to Steve Rogers, Sam became Captain America during Rick Remender's and Nick Spencer's runs. He has served as both an Avenger and a symbol of what Captain America represents beyond any single person."
  },
  {
    "slug": "star-lord",
    "name": "Peter Quill",
    "aliases": [
      "Star-Lord"
    ],
    "first_appearance_issue": "Marvel Preview #4 (1976)",
    "universe": "Earth-616",
    "teams": [
      "Guardians of the Galaxy",
      "Avengers"
    ],
    "description": "A half-human, half-Spartax prince who became the leader of the modern Guardians of the Galaxy. Reimagined by Keith Giffen in Annihilation: Conquest and developed by Abnett and Lanning into the wisecracking, reluctant leader of a ragtag cosmic team. Peter Quill's MCU counterpart brought the Guardians to global fame, but his comics incarnation is a more complex figure who has sacrificed everything for the galaxy multiple times."
  },
  {
    "slug": "gamora",
    "name": "Gamora",
    "aliases": [
      "The Most Dangerous Woman in the Universe",
      "Requiem"
    ],
    "first_appearance_issue": "Strange Tales #180 (1975)",
    "universe": "Earth-616",
    "teams": [
      "Guardians of the Galaxy",
      "Infinity Watch"
    ],
    "description": "Created by Jim Starlin, Gamora is the last of her species, raised by Thanos as the ultimate warrior and assassin. She turned against her adoptive father and allied with Adam Warlock, becoming a member of the Infinity Watch and later the Guardians of the Galaxy. In Infinity Wars (2018), she became the villain Requiem, killing Thanos and attempting to merge the universe with the Soul Gem."
  },
  {
    "slug": "drax",
    "name": "Arthur Douglas",
    "aliases": [
      "Drax the Destroyer"
    ],
    "first_appearance_issue": "Iron Man #55 (1973)",
    "universe": "Earth-616",
    "teams": [
      "Guardians of the Galaxy",
      "Infinity Watch"
    ],
    "description": "Created by Jim Starlin in the same issue as Thanos, Drax was originally Arthur Douglas, a human whose family was killed by Thanos. His spirit was placed in a powerful artificial body created by Kronos specifically to destroy Thanos. Drax killed Thanos in Annihilation by ripping out his heart. In the DnA Guardians era, he was reimagined as a more tactical, knife-wielding warrior."
  },
  {
    "slug": "rocket-raccoon",
    "name": "Rocket Raccoon",
    "aliases": [
      "Rocket",
      "89P13"
    ],
    "first_appearance_issue": "Marvel Preview #7 (1976)",
    "universe": "Earth-616",
    "teams": [
      "Guardians of the Galaxy"
    ],
    "description": "A genetically and cybernetically enhanced raccoon from Halfworld, Rocket is the tactical genius and weapons expert of the Guardians of the Galaxy. Originally a quirky solo character, he was reimagined by Abnett and Lanning as Star-Lord's right hand and the Guardians' military strategist. His MCU counterpart made him one of Marvel's most beloved characters."
  },
  {
    "slug": "groot",
    "name": "Groot",
    "aliases": [
      "The Monster from Planet X"
    ],
    "first_appearance_issue": "Tales to Astonish #13 (1960)",
    "universe": "Earth-616",
    "teams": [
      "Guardians of the Galaxy"
    ],
    "description": "Originally a monster villain in a pre-Marvel Universe story, Groot was reimagined as a sentient tree creature and member of the Guardians of the Galaxy. His vocabulary is limited to 'I am Groot,' though Rocket can understand the nuances of his speech. Groot can regenerate from a single twig, making him nearly immortal. His partnership with Rocket Raccoon is one of Marvel's most endearing relationships."
  },
  {
    "slug": "war-machine",
    "name": "James Rhodes",
    "aliases": [
      "War Machine",
      "Iron Man",
      "Iron Patriot"
    ],
    "first_appearance_issue": "Iron Man #118 (1979)",
    "universe": "Earth-616",
    "teams": [
      "Avengers",
      "West Coast Avengers",
      "U.S. Military"
    ],
    "description": "Tony Stark's best friend and military liaison who has worn the Iron Man armor multiple times, most notably during Stark's struggles with alcoholism. Rhodey eventually received his own heavily armed War Machine armor, becoming a permanent fixture in the Avengers roster. He has also served as Iron Patriot. His death in Civil War II was a major catalyst for the event's conflict."
  },
  {
    "slug": "jane-foster",
    "name": "Jane Foster",
    "aliases": [
      "Thor",
      "Valkyrie"
    ],
    "first_appearance_issue": "Journey into Mystery #84 (1962)",
    "universe": "Earth-616",
    "teams": [
      "Avengers",
      "Valkyrior"
    ],
    "description": "Originally Thor's mortal love interest and a nurse (later a doctor), Jane Foster was reimagined in Jason Aaron's Thor run as the new Thor when she lifted Mjolnir while battling terminal cancer. Each transformation into Thor purged her chemotherapy while leaving the cancer untreated, making every heroic act a step closer to death. Her sacrifice of Mjolnir to save Asgard from Mangog and subsequent death and resurrection is one of modern Marvel's most powerful stories. She later became the new Valkyrie."
  },
  {
    "slug": "hope-summers",
    "name": "Hope Summers",
    "aliases": [
      "Mutant Messiah"
    ],
    "first_appearance_issue": "X-Men (2004) #205 (2007)",
    "universe": "Earth-616",
    "teams": [
      "X-Men",
      "The Five",
      "X-Force"
    ],
    "description": "The first mutant born after the Scarlet Witch's Decimation, Hope was the focal point of Messiah Complex, Messiah War, and Second Coming. Raised in the future by Cable, she returned to the present as a young woman with the ability to mimic and stabilize other mutants' powers. In AvX, she channeled the Phoenix Force with the Scarlet Witch to restore mutantkind. On Krakoa, she became one of The Five, essential to the resurrection protocols."
  },
  {
    "slug": "jubilee",
    "name": "Jubilation Lee",
    "aliases": [
      "Jubilee",
      "Wondra"
    ],
    "first_appearance_issue": "Uncanny X-Men #244 (1989)",
    "universe": "Earth-616",
    "teams": [
      "X-Men",
      "Generation X",
      "New Warriors"
    ],
    "description": "A Chinese-American mutant who generates explosive plasmoids from her hands, Jubilee became Wolverine's young sidekick during the Australian Outback era and was a breakout star of the 1990s X-Men animated series. She was a founding member of Generation X, later lost her powers during Decimation, was turned into a vampire, and eventually had her mutant powers restored on Krakoa. She adopted a son, Shogo, making her one of Marvel's few superhero parents."
  },
  {
    "slug": "conan",
    "name": "Conan the Barbarian",
    "aliases": [
      "Conan of Cimmeria",
      "Conan the Cimmerian",
      "Amra the Lion"
    ],
    "first_appearance_issue": "Conan the Barbarian #1 (1970)",
    "universe": "Hyborian Age",
    "teams": [],
    "description": "A Cimmerian warrior who roams the Hyborian Age, an era predating recorded history. Created by Robert E. Howard in 1932, Conan was adapted into Marvel Comics by Roy Thomas and Barry Windsor-Smith starting with Conan the Barbarian #1 (1970). He rose from thief and mercenary to King of Aquilonia, wielding unmatched combat skill and savage cunning across one of Marvel's longest-running series."
  },
  {
    "slug": "doctor-aphra",
    "name": "Doctor Aphra",
    "aliases": [
      "Chelli Lona Aphra"
    ],
    "first_appearance_issue": "Darth Vader #3 (2015)",
    "universe": "Star Wars",
    "teams": [],
    "description": "A rogue archaeologist and one of the few original characters created for Marvel's Star Wars comics. Introduced in Kieron Gillen's Darth Vader series, Aphra is a morally grey treasure hunter who works with — and against — both the Empire and the Rebellion. She is accompanied by the homicidal droid pair BT-1 and 0-0-0, and starred in her own solo series running over 50 issues."
  },
  {
    "slug": "ghost-spider",
    "name": "Ghost-Spider",
    "aliases": [
      "Spider-Woman",
      "Spider-Gwen",
      "Gwen Stacy"
    ],
    "first_appearance_issue": "Edge of Spider-Verse #2 (2014)",
    "universe": "Earth-65",
    "teams": [
      "Spider-Army",
      "Web Warriors"
    ],
    "description": "An alternate-universe Gwen Stacy who was bitten by the radioactive spider instead of Peter Parker. Originally known as Spider-Woman of Earth-65, she became a breakout star of the Spider-Verse event and was given her own ongoing series. She later adopted the Ghost-Spider identity and enrolled at ESU in the main Marvel universe (Earth-616)."
  },
  {
    "slug": "darth-vader",
    "name": "Darth Vader",
    "aliases": [
      "Anakin Skywalker",
      "The Chosen One",
      "Lord Vader"
    ],
    "first_appearance_issue": "Star Wars #1 (1977)",
    "universe": "Star Wars",
    "teams": [
      "Galactic Empire",
      "Sith"
    ],
    "description": "The Dark Lord of the Sith and enforcer of the Galactic Empire. Marvel's Star Wars comics have explored Vader extensively across multiple solo series by Kieron Gillen, Charles Soule, and Greg Pak, covering periods between the original trilogy films. These series reveal his early days building his Sith identity, his discovery of Luke Skywalker's existence, and his complex relationship with the Emperor."
  },
  {
    "slug": "boba-fett",
    "name": "Boba Fett",
    "aliases": [],
    "first_appearance_issue": "Star Wars #42 (1980)",
    "universe": "Star Wars",
    "teams": [
      "Bounty Hunters Guild"
    ],
    "description": "The galaxy's most feared bounty hunter, a clone of Jango Fett raised as his son on Kamino. In Marvel's Star Wars comics, Boba Fett appears across multiple series as a recurring antagonist, hunting Han Solo and taking jobs from Darth Vader and Jabba the Hutt. He featured prominently in the War of the Bounty Hunters crossover event."
  },
  {
    "slug": "devil-dinosaur",
    "name": "Devil Dinosaur",
    "aliases": [
      "Devil",
      "Big Red"
    ],
    "first_appearance_issue": "Devil Dinosaur #1 (1978)",
    "universe": "Earth-616",
    "teams": [
      "Future Foundation"
    ],
    "description": "A massive, intelligent red Tyrannosaurus rex created by Jack Kirby. Originally from a prehistoric alternate Earth (Dinosaur World), Devil Dinosaur was bonded to Moon-Boy before being transported to the modern Marvel Universe. He later became the partner of Lunella Lafayette (Moon Girl), sharing a consciousness-swapping bond with the young Inhuman super-genius."
  },
  {
    "slug": "gwenpool",
    "name": "Gwenpool",
    "aliases": [
      "Gwen Poole"
    ],
    "first_appearance_issue": "Howard the Duck #1 (2015, backup story)",
    "universe": "Earth-616",
    "teams": [
      "West Coast Avengers",
      "MODOK's Mercenaries"
    ],
    "description": "Gwen Poole is a girl from 'our' world who was transported into the Marvel Universe. With knowledge of comics storylines and the awareness that she exists in a comic book, she uses her meta-knowledge to survive despite having no actual superpowers. Created initially as a variant cover gag combining Gwen Stacy and Deadpool aesthetics, she became a genuine character with her own ongoing series, The Unbelievable Gwenpool."
  },
  {
    "slug": "emperor-palpatine",
    "name": "Emperor Palpatine",
    "aliases": [
      "Darth Sidious",
      "The Emperor",
      "Sheev Palpatine"
    ],
    "first_appearance_issue": "Star Wars #1 (1977, mentioned); The Empire Strikes Back adaptation (1980, first appearance)",
    "universe": "Star Wars",
    "teams": [
      "Galactic Empire",
      "Sith"
    ],
    "description": "The Dark Lord of the Sith who orchestrated the fall of the Galactic Republic and the rise of the Empire. In Marvel's Star Wars comics, Palpatine appears as the shadowy puppet master behind Darth Vader, manipulating events from the Imperial throne. Various series explore his machinations between the films, including his schemes on Exegol and his obsession with controlling the Force."
  },
  {
    "slug": "kull",
    "name": "Kull the Conqueror",
    "aliases": [
      "Kull of Atlantis",
      "King Kull"
    ],
    "first_appearance_issue": "Creatures on the Loose #10 (1971)",
    "universe": "Hyborian Age",
    "teams": [],
    "description": "A barbarian from Atlantis who conquered the throne of Valusia in the pre-Cataclysmic Age, set thousands of years before Conan's Hyborian Age. Created by Robert E. Howard in 1929, Kull was adapted by Marvel in the early 1970s. His stories involve battles against serpent-men infiltrators and sorcerous threats to his kingdom, exploring themes of civilization versus barbarism."
  },
  {
    "slug": "kid-loki",
    "name": "Kid Loki",
    "aliases": [
      "Loki Laufeyson",
      "Ikol"
    ],
    "first_appearance_issue": "Thor #617 (2010)",
    "universe": "Earth-616",
    "teams": [
      "Young Avengers"
    ],
    "description": "A reincarnated younger version of Loki who appeared after the original Loki's death during the Siege of Asgard. Written primarily by Kieron Gillen in Journey into Mystery and later by Al Ewing, Kid Loki struggled to escape his predecessor's villainous legacy. His arc — a trickster god trying to be good while the universe expects him to be evil — is one of Marvel's most celebrated modern character studies."
  },
  {
    "slug": "darth-maul",
    "name": "Darth Maul",
    "aliases": [
      "Maul"
    ],
    "first_appearance_issue": "Star Wars: Darth Maul #1 (2000)",
    "universe": "Star Wars",
    "teams": [
      "Sith",
      "Crimson Dawn"
    ],
    "description": "The Zabrak Sith apprentice of Darth Sidious, trained as a weapon from childhood. In Marvel's Star Wars comics, Maul has starred in multiple miniseries exploring his time before The Phantom Menace and his survival after being bisected. He later became the shadowy leader of the Crimson Dawn crime syndicate, a role explored extensively in the Crimson Reign crossover."
  },
  {
    "slug": "yelena-belova",
    "name": "Yelena Belova",
    "aliases": [
      "Black Widow",
      "White Widow"
    ],
    "first_appearance_issue": "Inhumans #5 (1999)",
    "universe": "Earth-616",
    "teams": [
      "Red Room",
      "Thunderbolts",
      "S.H.I.E.L.D."
    ],
    "description": "The second woman to bear the Black Widow title, trained in the Red Room as Natasha Romanoff's successor. Yelena has served as both villain and anti-hero, working with the Thunderbolts and various intelligence agencies. She gained wider recognition through the MCU's Black Widow film and has recently adopted the White Widow identity in Marvel Comics."
  },
  {
    "slug": "red-sonja",
    "name": "Red Sonja",
    "aliases": [
      "She-Devil with a Sword",
      "Sonja of Hyrkania"
    ],
    "first_appearance_issue": "Conan the Barbarian #23 (1973)",
    "universe": "Hyborian Age",
    "teams": [],
    "description": "A fierce warrior woman of Hyrkania, known as the She-Devil with a Sword. Created by Roy Thomas and Barry Windsor-Smith for Marvel Comics, inspired by Robert E. Howard's Red Sonya of Rogatino. She first appeared alongside Conan and eventually starred in her own Marvel feature. Red Sonja became one of the most iconic female sword-and-sorcery characters in comics history."
  },
  {
    "slug": "han-solo",
    "name": "Han Solo",
    "aliases": [
      "Captain Solo"
    ],
    "first_appearance_issue": "Star Wars #1 (1977)",
    "universe": "Star Wars",
    "teams": [
      "Rebel Alliance",
      "Smugglers"
    ],
    "description": "The Corellian smuggler and captain of the Millennium Falcon who became a key leader of the Rebel Alliance. In Marvel's Star Wars comics, Han's adventures between the original trilogy films have been extensively explored, including his solo miniseries, his rivalry with other smugglers, and his relationships with Chewbacca and Leia Organa."
  },
  {
    "slug": "obi-wan-kenobi",
    "name": "Obi-Wan Kenobi",
    "aliases": [
      "Ben Kenobi",
      "Old Ben"
    ],
    "first_appearance_issue": "Star Wars #1 (1977)",
    "universe": "Star Wars",
    "teams": [
      "Jedi Order",
      "Rebel Alliance"
    ],
    "description": "A legendary Jedi Master who trained both Anakin and Luke Skywalker. In Marvel's Star Wars comics, Obi-Wan's exile years on Tatooine have been explored through journal entries read by Luke, revealing his struggles to protect the young Skywalker from a distance while hiding from the Empire. These stories appear as backup features across the main Star Wars series."
  },
  {
    "slug": "qira",
    "name": "Qi'ra",
    "aliases": [],
    "first_appearance_issue": "Star Wars: Age of Republic Special #1 (2019)",
    "universe": "Star Wars",
    "teams": [
      "Crimson Dawn"
    ],
    "description": "The leader of the Crimson Dawn crime syndicate and Han Solo's former love interest. In Marvel's Star Wars comics, Qi'ra is the central figure of the War of the Bounty Hunters and Crimson Reign crossover events, orchestrating a galaxy-spanning scheme against both the Empire and the Rebellion. She wields a Sith artifact and commands forces that threaten every major faction."
  },
  {
    "slug": "thrawn",
    "name": "Grand Admiral Thrawn",
    "aliases": [
      "Mitth'raw'nuruodo"
    ],
    "first_appearance_issue": "Star Wars: Thrawn #1 (2018)",
    "universe": "Star Wars",
    "teams": [
      "Galactic Empire",
      "Chiss Ascendancy"
    ],
    "description": "A Chiss military genius who rose to the rank of Grand Admiral in the Galactic Empire through sheer tactical brilliance. Originally created by Timothy Zahn for the Heir to the Empire novel, Thrawn was adapted into Marvel comics through a miniseries adapting his canonical backstory. He is known for studying a species' art to predict their military strategies."
  },
  {
    "slug": "red-guardian",
    "name": "Red Guardian",
    "aliases": [
      "Alexei Shostakov",
      "Alexi Shostakov"
    ],
    "first_appearance_issue": "Avengers #43 (1967)",
    "universe": "Earth-616",
    "teams": [
      "Winter Guard",
      "KGB"
    ],
    "description": "The Soviet Union's answer to Captain America, a super-soldier who served as a Cold War counterpart to the Avengers. The original Red Guardian, Alexei Shostakov, was Natasha Romanoff's husband before his apparent death. Multiple individuals have held the mantle, with the character gaining wider recognition through the MCU's Black Widow film."
  },
  {
    "slug": "kid-omega",
    "name": "Kid Omega",
    "aliases": [
      "Quentin Quire",
      "Phoenix"
    ],
    "first_appearance_issue": "New X-Men #134 (2003)",
    "universe": "Earth-616",
    "teams": [
      "X-Men",
      "X-Force",
      "West Coast Avengers"
    ],
    "description": "An Omega-level telepath and one of the most powerful mutants alive, introduced by Grant Morrison as a rebellious student at Xavier's School. Quentin Quire led a violent riot against the school in the 'Riot at Xavier's' arc (New X-Men #134-138). He later matured into an X-Men member during the Krakoan era, even briefly hosting the Phoenix Force."
  },
  {
    "slug": "jabba-the-hutt",
    "name": "Jabba the Hutt",
    "aliases": [
      "Jabba Desilijic Tiure"
    ],
    "first_appearance_issue": "Star Wars #2 (1977)",
    "universe": "Star Wars",
    "teams": [
      "Hutt Cartel"
    ],
    "description": "The notorious Hutt crime lord who controls a vast criminal empire from his palace on Tatooine. In Marvel's Star Wars comics, Jabba serves as a recurring antagonist, employing bounty hunters and clashing with Han Solo over unpaid debts. His criminal network features prominently in the War of the Bounty Hunters storyline."
  },
  {
    "slug": "anakin-skywalker",
    "name": "Anakin Skywalker",
    "aliases": [
      "The Chosen One",
      "Ani"
    ],
    "first_appearance_issue": "Star Wars: Episode I — The Phantom Menace adaptation (1999)",
    "universe": "Star Wars",
    "teams": [
      "Jedi Order",
      "Galactic Republic"
    ],
    "description": "The prophesied Chosen One of the Force who was trained as a Jedi but fell to the dark side, becoming Darth Vader. In Marvel's Star Wars comics, Anakin's time as a Jedi Knight during the Clone Wars has been explored in the Age of Republic series and various crossover events, depicting his relationship with Padmé Amidala and Obi-Wan Kenobi."
  },
  {
    "slug": "kylo-ren",
    "name": "Kylo Ren",
    "aliases": [
      "Ben Solo",
      "Master of the Knights of Ren"
    ],
    "first_appearance_issue": "Star Wars: The Force Awakens adaptation #1 (2016)",
    "universe": "Star Wars",
    "teams": [
      "First Order",
      "Knights of Ren"
    ],
    "description": "The son of Han Solo and Leia Organa who turned to the dark side under Snoke's influence, becoming the master of the Knights of Ren. In Marvel's Star Wars comics, his origin story was explored in Charles Soule's The Rise of Kylo Ren miniseries, depicting his fall from Ben Solo to dark side warrior and the destruction of Luke's Jedi temple."
  },
  {
    "slug": "luke-skywalker",
    "name": "Luke Skywalker",
    "aliases": [
      "Commander Skywalker",
      "Red Five"
    ],
    "first_appearance_issue": "Star Wars #1 (1977)",
    "universe": "Star Wars",
    "teams": [
      "Rebel Alliance",
      "Jedi Order"
    ],
    "description": "The farm boy from Tatooine who became the galaxy's last Jedi and a leader of the Rebel Alliance. Marvel's Star Wars comics extensively explore Luke's journey between the original trilogy films — his early struggles to learn the Force without a teacher, his discovery of his father's identity, and his growth from impulsive pilot to disciplined warrior."
  },
  {
    "slug": "ahsoka-tano",
    "name": "Ahsoka Tano",
    "aliases": [
      "Snips",
      "Fulcrum",
      "Ashla"
    ],
    "first_appearance_issue": "Star Wars: The Clone Wars #1 (2008, Dark Horse); Marvel debut in various Star Wars crossovers",
    "universe": "Star Wars",
    "teams": [
      "Jedi Order",
      "Rebel Alliance"
    ],
    "description": "A Togruta former Jedi Padawan of Anakin Skywalker who left the Jedi Order and later became a key figure in the early Rebel Alliance under the codename Fulcrum. While primarily developed in animation, Ahsoka has appeared in Marvel's Star Wars comics and gained her own dedicated stories, bridging the gap between the prequel and original trilogy eras."
  },
  {
    "slug": "honey-badger",
    "name": "Honey Badger",
    "aliases": [
      "Gabby Kinney",
      "Scout"
    ],
    "first_appearance_issue": "All-New Wolverine #2 (2016)",
    "universe": "Earth-616",
    "teams": [
      "X-Men"
    ],
    "description": "A clone-sister of X-23 (Laura Kinney), created by Alchemax Genetics as one of several Laura clones. Gabrielle is younger and more cheerful than Laura, providing a contrasting personality. She has a single retractable bone claw in each hand. Gabby was a central character in Tom Taylor's acclaimed All-New Wolverine run and later adopted the codename Scout."
  },
  {
    "slug": "jimmy-woo",
    "name": "Jimmy Woo",
    "aliases": [
      "James Woo"
    ],
    "first_appearance_issue": "Yellow Claw #1 (1956)",
    "universe": "Earth-616",
    "teams": [
      "Agents of Atlas",
      "S.H.I.E.L.D.",
      "FBI"
    ],
    "description": "A veteran FBI and S.H.I.E.L.D. agent who became the leader of the Agents of Atlas, a team of heroes from the 1950s. One of Marvel's earliest Asian-American characters, Jimmy Woo predates the Marvel Universe itself. He was reinvented by Jeff Parker as the head of Atlas, a secret organization, and gained wider recognition through the MCU's WandaVision and Ant-Man films."
  },
  {
    "slug": "aero",
    "name": "Aero",
    "aliases": [
      "Lei Ling"
    ],
    "first_appearance_issue": "Aero #1 (2019, Marvel; originally War of Realms: New Agents of Atlas #1)",
    "universe": "Earth-616",
    "teams": [
      "Agents of Atlas"
    ],
    "description": "A Chinese architect from Shanghai who can manipulate wind and air currents. Lei Ling was created as part of Marvel's New Agents of Atlas initiative, representing the publisher's expansion into Asian markets. She debuted during the War of the Realms event and joined the pan-Asian Agents of Atlas team led by Brawn (Amadeus Cho)."
  },
  {
    "slug": "sword-master",
    "name": "Sword Master",
    "aliases": [
      "Lin Lie"
    ],
    "first_appearance_issue": "Sword Master #1 (2019)",
    "universe": "Earth-616",
    "teams": [
      "Agents of Atlas"
    ],
    "description": "A young Chinese swordsman who wields the Sword of Fu Xi, an ancient mystical weapon tied to Chinese mythology. Lin Lie was searching for his missing father when he discovered his destiny as the Sword Master. He joined the Agents of Atlas and his stories blend Marvel superheroics with Chinese mythological elements."
  },
  {
    "slug": "solomon-kane",
    "name": "Solomon Kane",
    "aliases": [],
    "first_appearance_issue": "Savage Sword of Conan #13 (1975, Marvel magazine)",
    "universe": "Hyborian Age",
    "teams": [],
    "description": "A 16th-century English Puritan adventurer and swordsman created by Robert E. Howard. Solomon Kane roams the world fighting evil with his rapier, dirk, and flintlock pistols, driven by an unrelenting moral conviction. Marvel adapted Kane's prose stories in their black-and-white magazine line, with the character appearing in Savage Sword of Conan and later receiving his own miniseries."
  },
  {
    "slug": "poe-dameron",
    "name": "Poe Dameron",
    "aliases": [
      "Black Leader"
    ],
    "first_appearance_issue": "Star Wars: Poe Dameron #1 (2016)",
    "universe": "Star Wars",
    "teams": [
      "Resistance",
      "Black Squadron"
    ],
    "description": "The best pilot in the Resistance and leader of Black Squadron. In Marvel's Star Wars comics, Poe starred in his own 31-issue series by Charles Soule, set before The Force Awakens, following his missions to find Lor San Tekka and the map to Luke Skywalker. The series established his supporting cast and his rivalry with First Order Agent Terex."
  },
  {
    "slug": "captain-phasma",
    "name": "Captain Phasma",
    "aliases": [],
    "first_appearance_issue": "Star Wars: Captain Phasma #1 (2017)",
    "universe": "Star Wars",
    "teams": [
      "First Order"
    ],
    "description": "The chrome-armored commander of the First Order's stormtrooper legions. In Marvel's Star Wars comics, Phasma received a four-issue miniseries by Kelly Thompson set between The Force Awakens and The Last Jedi, depicting her ruthless efforts to cover up her role in the destruction of Starkiller Base and eliminate anyone who knew of her betrayal."
  },
  {
    "slug": "chewbacca",
    "name": "Chewbacca",
    "aliases": [
      "Chewie"
    ],
    "first_appearance_issue": "Star Wars #1 (1977)",
    "universe": "Star Wars",
    "teams": [
      "Rebel Alliance",
      "Smugglers"
    ],
    "description": "A Wookiee warrior from Kashyyyk and co-pilot of the Millennium Falcon alongside his life-partner Han Solo. In Marvel's Star Wars comics, Chewbacca starred in his own miniseries by Gerry Duggan and Phil Noto, and appears extensively throughout the main Star Wars series. His loyalty, strength, and centuries of combat experience make him one of the Rebellion's most formidable fighters."
  },
  {
    "slug": "yoda",
    "name": "Yoda",
    "aliases": [
      "Master Yoda"
    ],
    "first_appearance_issue": "The Empire Strikes Back adaptation (1980)",
    "universe": "Star Wars",
    "teams": [
      "Jedi Order",
      "Jedi High Council"
    ],
    "description": "The legendary Jedi Grand Master who trained Jedi for over 800 years before going into exile on Dagobah after the fall of the Republic. In Marvel's Star Wars comics, Yoda appears in flashback stories within the main Star Wars series, with tales of his missions during the High Republic and Clone Wars eras providing wisdom that guides Luke Skywalker's journey."
  }
]