[
    {
        "slug": "birth-of-marvel",
        "name": "The Birth of Marvel",
        "number": 1,
        "year_start": 1961,
        "year_end": 1966,
        "subtitle": "Lee, Kirby & Ditko Create a Universe",
        "description": "This is where the entire Marvel Universe begins. In November 1961, writer Stan Lee and artist Jack Kirby publish Fantastic Four #1 — a comic about a dysfunctional family of scientists who gain superpowers from cosmic radiation. It's unlike anything else on the market: the heroes argue with each other, have money problems, and feel like real people. The book is a massive hit, and over the next five years, Lee, Kirby, and artist Steve Ditko go on the most explosive creative streak in comic book history. They create Spider-Man (a teenage outcast who struggles with homework and guilt), the Avengers (a team-up of existing heroes including Thor, Iron Man, Hulk, and the recently-thawed WWII hero Captain America), the X-Men (teenagers born with mutant powers, hated and feared by society — a metaphor for prejudice), Thor (the actual Norse god, banished to Earth), Iron Man (a billionaire weapons manufacturer who builds a suit of armor to survive), the Hulk (a scientist cursed to transform into a raging monster), Doctor Strange (a surgeon who becomes Earth's mystical protector), and Daredevil (a blind lawyer who fights crime in Hell's Kitchen). Every single one of these characters is still headlining books and films today. The collected editions listed below contain the original comics published during 1961–1966 — the very first appearances and stories of these characters.",
        "color": "#1a237e"
    },
    {
        "slug": "the-expansion",
        "name": "The Cosmic Expansion",
        "number": 2,
        "year_start": 1966,
        "year_end": 1970,
        "subtitle": "Galactus, Silver Surfer, and the End of Lee & Kirby",
        "description": "With the core heroes established, Marvel's stories explode outward in scale. The Fantastic Four encounters Galactus — a god-like being who devours entire planets to survive — and his herald the Silver Surfer, a tragic alien who sacrificed his freedom to save his homeworld. These stories introduce the idea that the Marvel Universe extends far beyond Earth into a vast, dangerous cosmos full of alien empires (the Kree, the Skrulls), hidden civilizations (the Inhumans, a race of genetically modified humans living in a secret city), and forces beyond human comprehension. The Silver Surfer gets his own series exploring philosophical themes about humanity and freedom. Meanwhile, the creative partnership between Lee and Kirby — the two men most responsible for building this universe — begins to fracture over disputes about credit and creative ownership. By 1970, Kirby leaves Marvel entirely for rival publisher DC Comics, ending the most important collaboration in superhero history. The collected editions below reprint the original comics published during 1966–1970, including the Galactus Trilogy, the Silver Surfer solo series, and the final Lee/Kirby Fantastic Four issues.",
        "color": "#283593"
    },
    {
        "slug": "bronze-age",
        "name": "The Bronze Age",
        "number": 3,
        "year_start": 1970,
        "year_end": 1980,
        "subtitle": "Social Relevance, New Heroes, and Cosmic Mythology",
        "description": "With Kirby gone and the 1960s counterculture fading, Marvel reinvents itself for a new decade. Comics start tackling real-world social issues head-on: a landmark Spider-Man story addresses drug addiction (defying the Comics Code censorship authority for the first time), while Captain America confronts government corruption in a storyline inspired by the Watergate scandal. Marvel introduces a wave of new, diverse heroes who reflect a changing America — Luke Cage (the first Black superhero to headline his own book, a wrongly imprisoned man who gains unbreakable skin), Storm (an African weather-controlling mutant who will later lead the X-Men), Blade (a half-vampire vampire hunter, later played by Wesley Snipes in the film that launched the modern superhero movie era), Shang-Chi (a martial arts master), and Iron Fist (a kung-fu fighter with a mystical glowing punch). On the cosmic side, writer-artist Jim Starlin creates some of Marvel's most important mythology: Thanos, a death-obsessed alien tyrant who becomes one of fiction's greatest villains (and the main antagonist of the MCU's Avengers: Infinity War and Endgame), and Adam Warlock, a genetically perfect being who wields the Soul Gem. The Avengers face two defining sagas — the Kree-Skrull War (Earth caught between two warring alien empires) and the Korvac Saga (a time-traveling villain who achieves godhood). The collected editions below contain original comics published during 1970–1980.",
        "color": "#4527a0",
        "overlap_note": "Overlaps with the next era (1975–1980). Marvel's different title families evolved in parallel, so some comics from this period also appear in the next era."
    },
    {
        "slug": "rise-of-x-men",
        "name": "The Bronze Age Peak",
        "number": 4,
        "year_start": 1975,
        "year_end": 1985,
        "subtitle": "Claremont's X-Men, Miller's Daredevil, Byrne's FF, and Secret Wars",
        "description": "This decade produces several of the most celebrated and influential runs in comic book history, all happening simultaneously across different titles. In 1975, Marvel relaunches the X-Men with Giant-Size X-Men #1, introducing a new international team — Wolverine (a Canadian berserker with an unbreakable metal skeleton and retractable claws), Storm (the African weather goddess from the Bronze Age), Colossus (a gentle Russian farmer who transforms into living steel), and Nightcrawler (a German acrobat who looks like a blue demon). Writer Chris Claremont takes over the series and begins what becomes the longest, most influential single-author run in superhero comics — over 16 years. Under Claremont, the X-Men evolve from a struggling B-list title into Marvel's most popular franchise. He writes the Dark Phoenix Saga (1980), where the most powerful X-Man, Jean Grey, is corrupted by cosmic power and must be stopped by the people who love her — widely considered one of the greatest comic book stories ever told. He follows it with Days of Future Past (1981), a time-travel story set in a dystopian future where mutants are hunted by giant robots called Sentinels (adapted into one of the best X-Men films). At the same time, writer-artist Frank Miller takes Daredevil — previously a forgettable B-list hero — and transforms it into a dark, noir-influenced crime saga set in the gritty streets of Hell's Kitchen. Miller introduces Elektra (a deadly assassin and Matt Murdock's college ex-girlfriend) and elevates the Kingpin (Wilson Fisk) from a Spider-Man villain into Daredevil's primary nemesis. His run culminates in Born Again (1986), where the Kingpin systematically destroys Matt Murdock's life — his career, his home, his sanity — and Murdock must rebuild himself from nothing. Born Again is one of Marvel's all-time masterpieces. Meanwhile, John Byrne takes over The Fantastic Four and returns it to the inventive, cosmic grandeur of the Lee/Kirby era, producing a run that many consider the best FF since the original. In 1984, Marvel publishes Secret Wars, its first company-wide crossover event: a cosmic being called the Beyonder kidnaps every major Marvel hero and villain, drops them on an alien planet, and forces them to fight. It's a massive commercial hit, Spider-Man gets his iconic black costume (which later becomes the alien symbiote Venom), and the template for the modern crossover event is born. The collected editions below contain original comics published during 1975–1985.",
        "color": "#6a1b9a",
        "overlap_note": "Overlaps with the end of the Bronze Age (1975–1980) and the beginning of the Crossover Era (1985). Multiple landmark runs were happening simultaneously across Marvel."
    },
    {
        "slug": "event-age",
        "name": "The Crossover Era",
        "number": 5,
        "year_start": 1985,
        "year_end": 1992,
        "subtitle": "Annual Crossovers and the Infinity Gauntlet",
        "description": "The success of Secret Wars teaches Marvel a powerful lesson: crossover events sell. From this point forward, Marvel publishes at least one major multi-book crossover every year, and the X-Men franchise leads the way. Mutant Massacre (1986) is a brutal story where a team of assassins called the Marauders slaughters an underground community of mutants living in the sewers beneath New York — several X-Men are critically injured, and the tone of X-Men comics shifts permanently darker. Fall of the Mutants (1988) scatters the X-Men across the globe. Inferno (1989) unleashes literal demons across New York City as the X-Men's history comes back to haunt them. X-Tinction Agenda (1990) sees the team attacked by a foreign government that enslaves mutants. Each crossover is bigger than the last, spanning multiple X-Men titles and demanding readers buy every book to follow the story. Outside the X-Men, the biggest story of the era happens on the cosmic stage. Writer-artist Jim Starlin returns to the characters he created in the 1970s and writes The Infinity Gauntlet (1991): Thanos, the death-obsessed villain from the Bronze Age, finally collects all six Infinity Gems (later called Infinity Stones in the MCU), assembles them into the Infinity Gauntlet, and becomes omnipotent. With a snap of his fingers, he wipes out half of all life in the universe. Every Marvel hero — the Avengers, the X-Men, Spider-Man, the Fantastic Four — must unite to stop him. If this sounds familiar, it's because this six-issue comic is the direct source material for Avengers: Infinity War (2018) and Avengers: Endgame (2019). Meanwhile, artist Todd McFarlane gives Spider-Man a dramatic visual overhaul with exaggerated, kinetic artwork that makes McFarlane one of the most popular artists in the industry — setting the stage for what happens next. The collected editions below contain original comics published during 1985–1992.",
        "color": "#7b1fa2"
    },
    {
        "slug": "speculation-crash",
        "name": "The Boom & Bust",
        "number": 6,
        "year_start": 1992,
        "year_end": 1996,
        "subtitle": "Speculators, Artist Exodus, and Bankruptcy",
        "description": "The early 1990s is both the highest peak and the deepest valley in comic book history. It starts with an unprecedented boom: comic books become collectible investments, with speculators buying dozens of copies of each issue sealed in plastic bags, betting they'll be worth a fortune someday. Sales reach all-time highs. But in 1992, Marvel's most popular artists — Todd McFarlane (Spider-Man), Jim Lee (X-Men), Rob Liefeld (X-Force), and four others — leave Marvel en masse to form their own company, Image Comics, where they own their creations. It's the biggest talent exodus in comic book history, and it strips Marvel of its most commercially valuable creators overnight. Marvel responds by doubling down on gimmicks: holographic covers, die-cut covers, multiple variant covers for the same issue — anything to keep speculators buying. Meanwhile, the actual stories suffer. Spider-Man is saddled with the Clone Saga, a storyline that reveals Peter Parker might not be the real Spider-Man at all, but a clone. The story was supposed to last a few months but drags on for over two years, enraging fans and becoming one of the most notorious debacles in comic book history. The X-Men continue to sell well but the annual crossovers become formulaic. One genuine creative bright spot emerges: Age of Apocalypse (1995), a bold four-month event where Marvel cancels every X-Men title and replaces them with alternate-reality versions set in a dystopian world ruled by the villain Apocalypse. It's ambitious and well-received, but it can't save the broader market. The speculator bubble bursts as collectors realize their \"investments\" are worthless — millions of copies were printed, so nothing is actually rare. Sales plummet across the entire industry. In December 1996, Marvel Entertainment files for Chapter 11 bankruptcy. The collected editions below contain original comics published during 1992–1996.",
        "color": "#880e4f"
    },
    {
        "slug": "heroes-reborn-return",
        "name": "Heroes Reborn & Return",
        "number": 7,
        "year_start": 1996,
        "year_end": 1998,
        "subtitle": "A Desperate Experiment",
        "description": "Marvel is bankrupt and desperate. In the main comics, a massively powerful mutant villain named Onslaught (a psychic entity born from the combined darkness of Professor X and Magneto) threatens to destroy everything. To stop him, the Avengers, the Fantastic Four, and several other non-mutant heroes sacrifice their lives — seemingly dying in a final battle. But they don't actually die. Instead, Marvel cuts a deal with two of the artists who left for Image Comics — Jim Lee and Rob Liefeld — and hands them the Fantastic Four, Avengers, Iron Man, and Captain America titles to completely reboot from scratch. These heroes are reborn in a separate \"pocket universe\" with fresh origins, new designs, and no continuity baggage. This experiment, called Heroes Reborn, is commercially successful (the books sell well based on the star artists' names) but creatively divisive — longtime fans feel the new versions lack the depth of the originals. After about a year, Marvel ends the experiment. The heroes are returned to the main Marvel Universe in a storyline called Heroes Return, essentially hitting a reset button. The characters remember their original histories, the pocket universe is sealed off, and Marvel gets a fresh start without the baggage of the failed reboot. It's a short but important transitional period that bridges Marvel's darkest business era with the creative renaissance that follows. The collected editions below contain original comics published during 1996–1998.",
        "color": "#ad1457"
    },
    {
        "slug": "marvel-knights-ultimate",
        "name": "The Creative Renaissance",
        "number": 8,
        "year_start": 1998,
        "year_end": 2004,
        "subtitle": "Marvel Knights, the Ultimate Universe, and New Voices",
        "description": "Marvel climbs out of bankruptcy and enters what many fans consider its greatest creative period since the 1960s. The turnaround begins with a new editorial imprint called Marvel Knights, run by future Marvel Studios president Joe Quesada. The concept is simple but revolutionary for the time: take overlooked, B-list characters and pair them with the most talented writers and artists in the industry, then give those creators near-total creative freedom. The results are extraordinary. Writer Kevin Smith (the filmmaker behind Clerks and Chasing Amy) relaunches Daredevil with a noir-drenched mystery. Writer Brian Michael Bendis then takes over Daredevil and produces one of the greatest runs in the character's history, on par with Frank Miller's — Daredevil's secret identity is publicly exposed, and his life unravels in slow, devastating fashion. The Punisher is reimagined by writer Garth Ennis as a dark, violent, darkly comic war story. Black Panther gets a politically charged run by writer Christopher Priest that redefines the character for a generation. In 2000, Marvel launches an entirely separate continuity called the Ultimate Universe — a fresh, modern retelling of classic Marvel stories set in its own world with no prior continuity. Ultimate Spider-Man by Brian Michael Bendis reimagines Peter Parker as a contemporary teenager, and it's an ideal entry point for new readers. The Ultimates by Mark Millar reimagines the Avengers as a government-sponsored military strike force — its cinematic style directly inspires the look and tone of the Marvel Cinematic Universe films that begin a decade later. Writer Grant Morrison takes over the X-Men (titled New X-Men) and radically reinvents them, treating mutation as an emerging culture and subculture rather than just a superpower set. Jeph Loeb and Tim Sale produce a series of beloved, standalone limited series (Spider-Man: Blue, Daredevil: Yellow, Hulk: Gray) that are accessible to anyone. This era proves that great stories, not gimmick covers, are what bring readers back. The collected editions below contain original comics published during 1998–2004.",
        "color": "#c62828"
    },
    {
        "slug": "bendis-avengers",
        "name": "The Event Machine",
        "number": 9,
        "year_start": 2004,
        "year_end": 2012,
        "subtitle": "Yearly Universe-Shaking Events",
        "description": "Writer Brian Michael Bendis, fresh off his acclaimed Daredevil and Ultimate Spider-Man runs, becomes the architect of the entire Marvel Universe — and he reshapes it dramatically, year after year, through a chain of massive crossover events that each permanently change the status quo. It begins with Avengers Disassembled (2004): the Scarlet Witch (Wanda Maximoff), a longtime Avenger with reality-warping powers, suffers a mental breakdown and single-handedly destroys the Avengers, killing several members. The team disbands. Bendis then rebuilds them as the New Avengers — a grittier, street-level team featuring Spider-Man, Wolverine, and Luke Cage alongside traditional Avengers. House of M (2005) follows: the Scarlet Witch rewrites all of reality into a world where mutants rule and humans are the minority. When reality snaps back, she utters three words — \"No more mutants\" — and instantly depowers 99% of the world's mutant population, reducing the X-Men's species from millions to fewer than 200. This single moment reshapes every X-Men book for the next decade. Civil War (2006) is the era's most famous event: the U.S. government passes a law requiring all superheroes to register their identities and work under government supervision. Iron Man supports the law. Captain America opposes it. The Marvel Universe splits in half as heroes fight heroes — friends betray friends, Spider-Man publicly unmasks, and Captain America is assassinated on the steps of a courthouse (he gets better eventually). Civil War is directly adapted into the film Captain America: Civil War (2016). Secret Invasion (2008) reveals that shape-shifting alien Skrulls have been secretly replacing Marvel heroes for years — no one can trust anyone. Dark Reign (2008–2009) follows: the villain Norman Osborn (the Green Goblin) exploits the chaos to seize control of America's security apparatus, replacing S.H.I.E.L.D. with his own organization and assembling a team of villains disguised as Avengers. Siege (2010) ends the Osborn era when he launches an assault on Asgard (the Norse gods' home, which is hovering above Oklahoma). Meanwhile, far from Earth, Marvel's cosmic heroes experience their own renaissance. Annihilation (2006) sends an alien armada sweeping through the galaxy, and heroes like Nova and the Silver Surfer must stop it. This leads into the modern Guardians of the Galaxy team, which directly inspires the MCU film. The collected editions below contain original comics published during 2004–2012.",
        "color": "#d32f2f",
        "overlap_note": "Overlaps with the beginning of the Hickman era (2009–2012). Multiple architectural visions coexisted during this period."
    },
    {
        "slug": "hickman-saga",
        "name": "Hickman's Marvel",
        "number": 10,
        "year_start": 2009,
        "year_end": 2016,
        "subtitle": "One Writer, One Connected Saga Across Multiple Series",
        "description": "Writer Jonathan Hickman does something no one else has ever done at Marvel: he builds a single, meticulously planned narrative that spans multiple series over seven years, with every issue connecting to a grand cosmic blueprint. It begins in 2009 with Fantastic Four and its companion title FF, where Hickman redefines Reed Richards (Mr. Fantastic) as a man grappling with the limits of his own genius — he discovers a Council of alternate-universe Reeds who have solved every problem in their realities, but at terrible personal cost. Hickman introduces the idea of \"incursions\" — events where parallel universes collide and one must be destroyed or both die. In 2012, Hickman moves to The Avengers and New Avengers, where the incursion concept becomes the central crisis. In Avengers, he assembles the largest Avengers roster in history to fight cosmic-scale threats. In New Avengers (also called \"The Illuminati\"), a secret council of Marvel's smartest heroes — Reed Richards, Tony Stark, Black Panther, Doctor Strange, Namor, and Black Bolt — must decide whether to destroy other Earths to save their own. The moral weight is crushing: these are heroes forced to consider genocide to prevent extinction. The two series run in parallel for three years, building toward an inevitable collision. It all culminates in Secret Wars (2015–2016), where the entire Marvel multiverse is destroyed. Every universe collides and is annihilated — except for fragments that Doctor Doom salvages and stitches together into a patchwork planet called Battleworld, where Doom rules as God. The remaining heroes must overthrow Doom and rebuild reality from scratch. Secret Wars is widely considered one of Marvel's greatest achievements — a genuinely earned, emotionally devastating conclusion to years of setup. When reality is restored, the Marvel Universe is subtly different: the Ultimate Universe's Miles Morales now lives in the main Marvel world, and the stage is set for a new era. If you enjoy long-form, intricately plotted storytelling where every detail matters and every thread pays off — the kind of fiction that rewards patience and close reading — Hickman's Marvel is among the best the medium has ever produced. The collected editions below contain original comics published during 2009–2016.",
        "color": "#e53935",
        "overlap_note": "Overlaps with the previous era (2009–2012). Hickman's interconnected narrative started while Bendis was still the primary Avengers architect."
    },
    {
        "slug": "all-new-all-different",
        "name": "All-New All-Different",
        "number": 11,
        "year_start": 2015,
        "year_end": 2018,
        "subtitle": "New Heroes Step Up",
        "description": "After Hickman's Secret Wars rebuilds the multiverse, Marvel relaunches its entire line under the banner \"All-New All-Different Marvel.\" The premise is a changing of the guard: new characters take up the mantles of classic heroes, often alongside or in place of the originals. Miles Morales, the Afro-Latino Spider-Man who was originally from the now-destroyed Ultimate Universe, is folded into the main Marvel world and co-exists with Peter Parker. Jane Foster — Thor's longtime love interest — is revealed to be the new Thor, wielding Mjolnir while battling terminal cancer in her human form. Every time she transforms into Thor, the transformation purges her chemotherapy, meaning being a hero is literally killing her. It's one of the most emotionally powerful Marvel stories of the decade. Kamala Khan, a Pakistani-American teenager from New Jersey, continues her beloved Ms. Marvel series (launched in 2014), becoming one of Marvel's most popular new characters. Sam Wilson (the Falcon) takes over as Captain America. Amadeus Cho becomes the Totally Awesome Hulk. The era produces several critically acclaimed standalone runs: The Vision by Tom King tells the story of the android Avenger building a synthetic family in suburban Virginia — it's a haunting, literary masterpiece that reads like a Raymond Carver short story set in the Marvel Universe. Black Panther by Ta-Nehisi Coates (the acclaimed Between the World and Me author) brings literary weight and political philosophy to T'Challa's Wakanda. However, the era is also marked by event fatigue. Civil War II (2016) pits Iron Man against Captain Marvel over whether to use a precognitive Inhuman to prevent crimes before they happen — it's divisive and lacks the emotional impact of the original Civil War. Secret Empire (2017) reveals that Captain America has been a secret Hydra agent all along (due to reality manipulation by a cosmic artifact) and takes over the United States — it's controversial and unsettling by design. Multiple sub-relaunches (Marvel NOW! 2.0, Marvel Legacy) in quick succession create confusion about what's a good jumping-on point. The era ends with the \"Fresh Start\" initiative in mid-2018, which returns most classic heroes to their original mantles. The collected editions below contain original comics published during 2015–2018.",
        "color": "#ef5350"
    },
    {
        "slug": "dawn-of-krakoa",
        "name": "The Krakoa Era",
        "number": 12,
        "year_start": 2019,
        "year_end": 2024,
        "subtitle": "Mutants Build a Nation, Then Lose Everything",
        "description": "Jonathan Hickman returns to Marvel and does for the X-Men what he previously did for the Avengers and Fantastic Four: he completely reinvents them with a single, audacious premise. In House of X / Powers of X (2019), a pair of intertwined miniseries that must be read together, Hickman reveals that Professor Charles Xavier has been playing a much longer game than anyone realized. Mutants stop fighting for acceptance within human society and instead establish their own sovereign nation on Krakoa, a living, sentient island in the Pacific Ocean. They develop resurrection protocols — biotechnology that allows any mutant who dies to be brought back to life with all their memories intact. Death, the defining tragedy of X-Men stories for decades, is conquered. Even more radically, former villains like Magneto, Apocalypse, Mister Sinister, and Mystique are welcomed as citizens of Krakoa. The X-Men's fundamental metaphor shifts: they're no longer a persecuted minority asking for tolerance — they're a post-human civilization that has transcended humanity's limitations and is building something entirely new. The Krakoan era unfolds in phases. Hickman's initial run (2019–2021) establishes the new status quo and introduces mysteries — including the revelation that Moira MacTaggert, a character fans thought they knew for 40 years, is actually a mutant whose power is reincarnation, meaning she has lived and died multiple times, each life giving her knowledge of different possible futures. Hickman departs after the Inferno miniseries (late 2021), and subsequent phases are guided by writers Kieron Gillen (Immortal X-Men, a political thriller about the ruling council of Krakoa), Al Ewing (X-Men Red, set on Mars which mutants have terraformed and claimed), Gerry Duggan (X-Men, the flagship team book), and Si Spurrier (Legion of X, exploring Krakoan law and spirituality). The era's final phase, Fall of X (2023–2024), sees Krakoa's utopia collapse from within and without — the anti-mutant organization Orchis infiltrates and destroys the nation, the resurrection protocols are compromised, and mutants are hunted once again. It ends with Fall of the House of X / Rise of the Powers of X (2024), closing out the most ambitious X-Men reinvention since 1975's Giant-Size X-Men #1. The collected editions below contain original comics published during 2019–2024.",
        "color": "#f44336"
    },
    {
        "slug": "blood-hunt-doom",
        "name": "Blood Hunt & Doom",
        "number": 13,
        "year_start": 2024,
        "year_end": 2025,
        "subtitle": "A Vampire Apocalypse, Then Doctor Doom Takes Over the World",
        "description": "Two major, back-to-back events reshape the Marvel Universe in rapid succession. First comes Blood Hunt (2024, 5 issues by writer Jed MacKay): Blade, the half-vampire vampire hunter, is possessed by Varnae, an ancient and immensely powerful vampire. Under Varnae's control, Blade orchestrates a global vampire apocalypse — the sun is blotted out, vampires swarm every major city, and civilization teeters on the edge. The Avengers, X-Men, and other heroes must fight through a world plunged into supernatural darkness to save Blade and stop the invasion. The event's most consequential moment happens at its climax: Doctor Strange, Earth's Sorcerer Supreme and its primary magical protector, sacrifices his physical body to help end the crisis. As he dies, he transfers the title of Sorcerer Supreme to the last person anyone would expect — Doctor Victor Von Doom, the armored dictator of the fictional European nation Latveria, and one of Marvel's greatest villains. This leads directly into One World Under Doom (2024–2025, 9 issues by writer Ryan North and artist R.B. Silva), the era's defining story. Armed with both his technological genius and the full magical power of the Sorcerer Supreme, Doom does something unprecedented: he takes over the entire world, not through conquest, but through competence. He declares \"United Latveria,\" abolishes war between nations, provides universal free healthcare, mandates free education, and begins solving climate change. Civilians genuinely embrace his rule because their lives are measurably, objectively better. This puts Marvel's heroes in an impossible moral position — do you fight the dictator who is actually saving lives? Is freedom worth more than safety? The Avengers, Fantastic Four, and Spider-Man must grapple with these questions while searching for the inevitable catch in Doom's benevolence. The event concludes in November 2025 with Doom's defeat and the Scarlet Witch (Wanda Maximoff, whose breakdown destroyed the Avengers back in 2004) assuming the mantle of Sorcerer Supreme. The collected editions below contain original comics published during 2024–2025.",
        "color": "#ff1744"
    },
    {
        "slug": "current-ongoings",
        "name": "Current Ongoings",
        "number": 14,
        "year_start": 2025,
        "year_end": 2026,
        "subtitle": "What's Happening Right Now",
        "description": "This is the present. Doom's reign has ended, the Scarlet Witch is the new Sorcerer Supreme, and the Marvel Universe is picking up the pieces. The X-Men line relaunches under a new banner called \"Shadows of Tomorrow\" (January 2026), establishing a new direction for mutantkind after the fall of Krakoa. Hickman's Ultimate Universe — the separate continuity he launched alongside his Krakoa work — concludes with Ultimate Endgame. Jed MacKay's acclaimed Avengers run, which began during the Blood Hunt era, wraps up in March 2026. The next major event on the horizon is Armageddon by writer Chip Zdarsky, launching in June 2026 and promising upheaval on the scale of Avengers Disassembled. The collected editions below contain comics currently being published — many of these series are still ongoing, so this section will grow as new collections are released. If you want to walk into a comic shop and start reading today, this is where to look.",
        "color": "#ff5252"
    }
]
